-- MySQL dump 10.13  Distrib 5.6.11, for Win32 (x86)
--
-- Host: localhost    Database: u1wanoa
-- ------------------------------------------------------
-- Server version	5.6.11

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `yy_admin_group`
--

DROP TABLE IF EXISTS `yy_admin_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_admin_group` (
  `groupid` tinyint(1) unsigned NOT NULL AUTO_INCREMENT COMMENT '管理组ID',
  `name` varchar(60) NOT NULL DEFAULT '' COMMENT '名称',
  PRIMARY KEY (`groupid`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='管理组表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_admin_group`
--

LOCK TABLES `yy_admin_group` WRITE;
/*!40000 ALTER TABLE `yy_admin_group` DISABLE KEYS */;
INSERT INTO `yy_admin_group` VALUES (1,'超级管理员');
/*!40000 ALTER TABLE `yy_admin_group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_admin_privilege`
--

DROP TABLE IF EXISTS `yy_admin_privilege`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_admin_privilege` (
  `groupid` tinyint(1) unsigned NOT NULL COMMENT '管理组ID',
  `pid` int(10) unsigned NOT NULL COMMENT '权限ID',
  `cando` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '0不能执行 1能执行',
  PRIMARY KEY (`groupid`,`pid`),
  KEY `admin_privilege_pid` (`pid`),
  CONSTRAINT `admin_privilege_groupid` FOREIGN KEY (`groupid`) REFERENCES `yy_admin_group` (`groupid`),
  CONSTRAINT `admin_privilege_pid` FOREIGN KEY (`pid`) REFERENCES `yy_privilege` (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='管理组权限表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_admin_privilege`
--

LOCK TABLES `yy_admin_privilege` WRITE;
/*!40000 ALTER TABLE `yy_admin_privilege` DISABLE KEYS */;
/*!40000 ALTER TABLE `yy_admin_privilege` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_affair_apply`
--

DROP TABLE IF EXISTS `yy_affair_apply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_affair_apply` (
  `aid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '事务ID',
  `uid` int(10) unsigned NOT NULL COMMENT '审批人/申请人',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '提交时间',
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '类型,用中文',
  `id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '处理哪件事的ID，根据情况变化',
  `title` varchar(200) NOT NULL DEFAULT '' COMMENT '标题',
  `url` varchar(200) NOT NULL DEFAULT '' COMMENT '详情的链接',
  `ajax` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否是ajax加载',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '对于审批人:1待审批 2已审批|对于申请人:3申请中 4申请完毕',
  PRIMARY KEY (`aid`),
  UNIQUE KEY `uid` (`uid`,`name`,`id`),
  KEY `affair_apply_name` (`name`),
  CONSTRAINT `affair_apply_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`),
  CONSTRAINT `affair_apply_name` FOREIGN KEY (`name`) REFERENCES `yy_member_verify_setting` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=150 DEFAULT CHARSET=utf8 COMMENT='申请统计表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_affair_apply`
--

LOCK TABLES `yy_affair_apply` WRITE;
/*!40000 ALTER TABLE `yy_affair_apply` DISABLE KEYS */;
INSERT INTO `yy_affair_apply` VALUES (1,26,1415425106,'薪资审批',15,'薪资审批单','/Home/Salary/showApplyProcess/aid/15.html',1,4),(3,39,1415425448,'考勤更正申请',20,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/20.html',1,3),(4,1,1415425448,'考勤更正申请',20,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/20.html',1,1),(5,39,1415425500,'考勤更正申请',21,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/21.html',1,3),(6,1,1415425500,'考勤更正申请',21,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/21.html',1,1),(7,39,1415425538,'考勤更正申请',22,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/22.html',1,3),(8,1,1415425538,'考勤更正申请',22,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/22.html',1,1),(9,7,1415425587,'考勤更正申请',23,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/23.html',1,3),(10,1,1415425587,'考勤更正申请',23,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/23.html',1,1),(11,7,1415425612,'考勤更正申请',24,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/24.html',1,3),(12,1,1415425612,'考勤更正申请',24,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/24.html',1,1),(13,7,1415425675,'考勤更正申请',25,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/25.html',1,3),(14,1,1415425675,'考勤更正申请',25,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/25.html',1,1),(15,32,1415425688,'假期审批',33,'假期审批单','/Home/Nvacation/showApplyProcess/aid/33.html',1,4),(16,1,1415425688,'假期审批',33,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/33.html',1,2),(17,7,1415425689,'考勤更正申请',26,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/26.html',1,3),(18,1,1415425689,'考勤更正申请',26,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/26.html',1,1),(19,7,1415425743,'考勤更正申请',27,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/27.html',1,3),(20,1,1415425743,'考勤更正申请',27,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/27.html',1,1),(21,7,1415425782,'考勤更正申请',28,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/28.html',1,3),(22,1,1415425782,'考勤更正申请',28,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/28.html',1,1),(23,26,1415425836,'薪资审批',16,'薪资审批单','/Home/Salary/showApplyProcess/aid/16.html',1,4),(24,1,1415425836,'薪资审批',16,'薪资审批审批单','/Home/Salary/showExamineProcess/aid/16.html',1,2),(25,7,1415425895,'考勤更正申请',29,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/29.html',1,3),(26,1,1415425895,'考勤更正申请',29,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/29.html',1,1),(27,32,1415426071,'假期审批',34,'假期审批单','/Home/Nvacation/showApplyProcess/aid/34.html',1,4),(28,1,1415426071,'假期审批',34,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/34.html',1,2),(29,22,1415426214,'考勤更正申请',30,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/30.html',1,3),(30,18,1415426214,'考勤更正申请',30,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/30.html',1,1),(31,22,1415426232,'考勤更正申请',31,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/31.html',1,3),(32,18,1415426232,'考勤更正申请',31,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/31.html',1,1),(33,26,1415426769,'假期审批',35,'假期审批单','/Home/Nvacation/showApplyProcess/aid/35.html',1,4),(34,1,1415426769,'假期审批',35,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/35.html',1,2),(35,34,1415426773,'假期审批',36,'假期审批单','/Home/Nvacation/showApplyProcess/aid/36.html',1,4),(36,1,1415426773,'假期审批',36,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/36.html',1,2),(37,18,1415426797,'假期审批',35,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/35.html',1,2),(38,32,1415428120,'考勤更正申请',32,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/32.html',1,4),(39,32,1415428154,'考勤更正申请',33,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/33.html',1,4),(40,34,1415428741,'假期审批',37,'假期审批单','/Home/Nvacation/showApplyProcess/aid/37.html',1,3),(41,1,1415428741,'假期审批',37,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/37.html',1,2),(42,32,1415428774,'假期审批',37,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/37.html',1,1),(43,34,1415428877,'假期审批',38,'假期审批单','/Home/Nvacation/showApplyProcess/aid/38.html',1,3),(44,1,1415428877,'假期审批',38,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/38.html',1,1),(45,37,1415430134,'假期审批',39,'假期审批单','/Home/Nvacation/showApplyProcess/aid/39.html',1,3),(46,1,1415430134,'假期审批',39,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/39.html',1,1),(47,39,1415430224,'考勤更正申请',34,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/34.html',1,3),(48,1,1415430224,'考勤更正申请',34,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/34.html',1,1),(49,37,1415430317,'假期审批',40,'假期审批单','/Home/Nvacation/showApplyProcess/aid/40.html',1,3),(50,1,1415430317,'假期审批',40,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/40.html',1,1),(51,39,1415430679,'假期审批',41,'假期审批单','/Home/Nvacation/showApplyProcess/aid/41.html',1,3),(52,1,1415430679,'假期审批',41,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/41.html',1,1),(53,37,1415430861,'假期审批',42,'假期审批单','/Home/Nvacation/showApplyProcess/aid/42.html',1,3),(54,1,1415430861,'假期审批',42,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/42.html',1,1),(55,10,1415433328,'考勤更正申请',35,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/35.html',1,3),(56,1,1415433328,'考勤更正申请',35,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/35.html',1,1),(57,5,1415434353,'假期审批',43,'假期审批单','/Home/Nvacation/showApplyProcess/aid/43.html',1,4),(58,3,1415434353,'假期审批',43,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/43.html',1,2),(59,5,1415436167,'假期审批',44,'假期审批单','/Home/Nvacation/showApplyProcess/aid/44.html',1,3),(61,5,1415436323,'假期审批',45,'假期审批单','/Home/Nvacation/showApplyProcess/aid/45.html',1,4),(63,5,1415437284,'假期审批',46,'假期审批单','/Home/Nvacation/showApplyProcess/aid/46.html',1,4),(64,3,1415437284,'假期审批',46,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/46.html',1,2),(65,5,1415439225,'假期审批',47,'假期审批单','/Home/Nvacation/showApplyProcess/aid/47.html',1,4),(66,3,1415439225,'假期审批',47,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/47.html',1,2),(67,26,1415589018,'考勤更正申请',36,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/36.html',1,3),(68,18,1415589018,'考勤更正申请',36,'考勤更正申请审批单','/Home/Attendance/showExamineProcess/aid/36.html',1,2),(69,32,1415589048,'考勤更正申请',36,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/36.html',1,1),(70,27,1415589691,'考勤更正申请',37,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/37.html',1,3),(71,18,1415589691,'考勤更正申请',37,'考勤更正申请审批单','/Home/Attendance/showExamineDialog/aid/37.html',1,1),(72,27,1415590024,'假期审批',48,'假期审批单','/Home/Nvacation/showApplyProcess/aid/48.html',1,4),(73,18,1415590024,'假期审批',48,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/48.html',1,2),(74,27,1415590996,'假期审批',49,'假期审批单','/Home/Nvacation/showApplyProcess/aid/49.html',1,4),(75,18,1415590996,'假期审批',49,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/49.html',1,2),(76,27,1415595967,'假期审批',50,'假期审批单','/Home/Nvacation/showApplyProcess/aid/50.html',1,3),(77,18,1415595967,'假期审批',50,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/50.html',1,1),(78,18,1415599098,'假期审批',51,'假期审批单','/Home/Nvacation/showApplyProcess/aid/51.html',1,4),(79,32,1415600388,'假期审批',52,'假期审批单','/Home/Nvacation/showApplyProcess/aid/52.html',1,3),(80,31,1415600388,'假期审批',52,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/52.html',1,2),(81,2,1415600442,'假期审批',52,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/52.html',1,1),(82,32,1415600578,'假期审批',53,'假期审批单','/Home/Nvacation/showApplyProcess/aid/53.html',1,4),(83,31,1415600578,'假期审批',53,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/53.html',1,2),(84,7,1415600668,'假期审批',53,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/53.html',1,2),(85,7,1415600805,'假期审批',54,'假期审批单','/Home/Nvacation/showApplyProcess/aid/54.html',1,3),(86,3,1415600805,'假期审批',54,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/54.html',1,1),(87,31,1415600869,'假期审批',55,'假期审批单','/Home/Nvacation/showApplyProcess/aid/55.html',1,3),(88,7,1415600869,'假期审批',55,'假期审批审批单','/Home/Nvacation/showExamineDialog/aid/55.html',1,1),(89,31,1415601078,'假期审批',56,'假期审批单','/Home/Nvacation/showApplyProcess/aid/56.html',1,4),(90,31,1415602456,'考勤更正申请',38,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/38.html',1,4),(91,31,1415602559,'考勤更正申请',39,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/39.html',1,4),(92,32,1415602894,'考勤更正申请',40,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/40.html',1,4),(93,31,1415602895,'考勤更正申请',40,'考勤更正申请审批单','/Home/Attendance/showExamineProcess/aid/40.html',1,2),(94,31,1415603130,'假期审批',57,'假期审批单','/Home/Nvacation/showApplyProcess/aid/57.html',1,4),(95,32,1415603352,'假期审批',58,'假期审批单','/Home/Nvacation/showApplyProcess/aid/58.html',1,4),(96,31,1415603352,'假期审批',58,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/58.html',1,2),(97,32,1415603822,'假期审批',59,'假期审批单','/Home/Nvacation/showApplyProcess/aid/59.html',1,4),(98,31,1415603822,'假期审批',59,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/59.html',1,2),(99,32,1415603907,'考勤更正申请',41,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/41.html',1,4),(100,31,1415603907,'考勤更正申请',41,'考勤更正申请审批单','/Home/Attendance/showExamineProcess/aid/41.html',1,2),(101,32,1415604017,'假期审批',60,'假期审批单','/Home/Nvacation/showApplyProcess/aid/60.html',1,4),(102,31,1415604017,'假期审批',60,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/60.html',1,2),(103,32,1415604039,'假期审批',61,'假期审批单','/Home/Nvacation/showApplyProcess/aid/61.html',1,4),(104,31,1415604039,'假期审批',61,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/61.html',1,2),(105,32,1415604370,'假期审批',62,'假期审批单','/Home/Nvacation/showApplyProcess/aid/62.html',1,4),(106,31,1415604370,'假期审批',62,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/62.html',1,2),(107,32,1415604558,'考勤更正申请',42,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/42.html',1,4),(108,31,1415604558,'考勤更正申请',42,'考勤更正申请审批单','/Home/Attendance/showExamineProcess/aid/42.html',1,2),(109,32,1415604696,'考勤更正申请',43,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/43.html',1,4),(110,31,1415604696,'考勤更正申请',43,'考勤更正申请审批单','/Home/Attendance/showExamineProcess/aid/43.html',1,2),(111,34,1415604785,'假期审批',63,'假期审批单','/Home/Nvacation/showApplyProcess/aid/63.html',1,4),(112,31,1415604785,'假期审批',63,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/63.html',1,2),(113,39,1415605119,'假期审批',64,'假期审批单','/Home/Nvacation/showApplyProcess/aid/64.html',1,4),(114,3,1415605119,'假期审批',64,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/64.html',1,2),(115,39,1415605867,'假期审批',65,'假期审批单','/Home/Nvacation/showApplyProcess/aid/65.html',1,4),(116,3,1415605867,'假期审批',65,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/65.html',1,2),(117,39,1415606288,'薪资审批',17,'薪资审批单','/Home/Salary/showApplyProcess/aid/17.html',1,3),(118,1,1415606288,'薪资审批',17,'薪资审批审批单','/Home/Salary/showExamineDialog/aid/17.html',0,1),(119,31,1415606355,'假期审批',66,'假期审批单','/Home/Nvacation/showApplyProcess/aid/66.html',1,4),(120,32,1415606858,'假期审批',67,'假期审批单','/Home/Nvacation/showApplyProcess/aid/67.html',1,4),(121,31,1415606858,'假期审批',67,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/67.html',1,2),(122,39,1415607023,'假期审批',68,'假期审批单','/Home/Nvacation/showApplyProcess/aid/68.html',1,4),(123,3,1415607023,'假期审批',68,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/68.html',1,2),(124,32,1415607183,'假期审批',69,'假期审批单','/Home/Nvacation/showApplyProcess/aid/69.html',1,4),(125,31,1415607183,'假期审批',69,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/69.html',1,2),(126,27,1415607187,'假期审批',70,'假期审批单','/Home/Nvacation/showApplyProcess/aid/70.html',1,4),(127,18,1415607187,'假期审批',70,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/70.html',1,2),(128,32,1415607326,'考勤更正申请',44,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/44.html',1,4),(129,31,1415607326,'考勤更正申请',44,'考勤更正申请审批单','/Home/Attendance/showExamineProcess/aid/44.html',1,2),(130,39,1415607434,'假期审批',71,'假期审批单','/Home/Nvacation/showApplyProcess/aid/71.html',1,4),(131,3,1415607434,'假期审批',71,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/71.html',1,2),(132,34,1415607476,'假期审批',72,'假期审批单','/Home/Nvacation/showApplyProcess/aid/72.html',1,4),(133,31,1415607476,'假期审批',72,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/72.html',1,2),(134,31,1415607684,'考勤更正申请',45,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/45.html',1,4),(135,31,1415607747,'假期审批',73,'假期审批单','/Home/Nvacation/showApplyProcess/aid/73.html',1,4),(136,34,1415607847,'假期审批',74,'假期审批单','/Home/Nvacation/showApplyProcess/aid/74.html',1,4),(137,31,1415607847,'假期审批',74,'假期审批审批单','/Home/Nvacation/showExamineProcess/aid/74.html',1,2),(138,39,1415608544,'假期审批',75,'假期审批单','/Home/Nvacation/showApplyProcess/aid/75.html',1,4),(139,31,1415609393,'考勤更正申请',46,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/46.html',1,4),(140,31,1415609496,'假期审批',76,'假期审批单','/Home/Nvacation/showApplyProcess/aid/76.html',1,4),(141,31,1415609548,'考勤更正申请',47,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/47.html',1,4),(142,31,1415609711,'考勤更正申请',48,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/48.html',1,4),(143,31,1415611316,'考勤更正申请',49,'考勤更正申请单','/Home/Attendance/showApplyProcess/aid/49.html',1,4);
/*!40000 ALTER TABLE `yy_affair_apply` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_attendance_apply`
--

DROP TABLE IF EXISTS `yy_attendance_apply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_attendance_apply` (
  `aid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `uid` int(10) unsigned NOT NULL COMMENT '员工ID',
  `workday` date NOT NULL COMMENT '工作的日期',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '提交申请的时间',
  `reason` varchar(1000) NOT NULL DEFAULT '' COMMENT '申请的理由',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1请假 2未签到 3迟到 4早退 5未签退 6旷工(未签到签退) 7正常',
  `process` tinyint(1) NOT NULL DEFAULT '0' COMMENT '-1成功 -2失败 0未审核 1审核人1 2审核人2以此类推',
  `howmany` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '总共几个人处理',
  PRIMARY KEY (`aid`),
  KEY `attendance_apply_uid` (`uid`),
  CONSTRAINT `attendance_apply_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8 COMMENT='员工考勤更正申请表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_attendance_apply`
--

LOCK TABLES `yy_attendance_apply` WRITE;
/*!40000 ALTER TABLE `yy_attendance_apply` DISABLE KEYS */;
INSERT INTO `yy_attendance_apply` VALUES (5,39,'2014-10-11',1414839012,'请假了的',2,-2,0),(6,39,'2014-09-30',1414839015,'我想早退',4,-1,0),(7,39,'2014-10-13',1414839100,'不想签退了',5,-1,0),(14,30,'2014-10-16',1415348755,'奥特曼',7,-2,0),(18,26,'2014-10-11',1415423885,'忘记打卡',7,-1,0),(20,39,'2014-10-11',1415425448,'请假了',7,1,0),(21,39,'2014-10-11',1415425500,'没来',7,1,0),(22,39,'2014-10-31',1415425538,'mein',2,1,0),(23,7,'2014-11-07',1415425587,'正常',7,1,0),(24,7,'2014-11-07',1415425612,'撒旦教',2,1,0),(25,7,'2014-11-03',1415425675,'正常',7,1,0),(26,7,'2014-11-04',1415425689,'正常',8,1,0),(27,7,'2014-09-25',1415425743,'正常',7,1,0),(28,7,'2014-10-16',1415425782,'忘记打卡',7,1,0),(29,7,'2014-10-10',1415425895,'周六',7,1,0),(30,22,'2014-10-28',1415426214,'正藏',7,1,0),(31,22,'2014-10-28',1415426232,'都是法国',2,1,0),(32,32,'2014-10-06',1415428120,'01',7,-1,0),(33,32,'2014-10-06',1415428154,'21',7,-1,0),(34,39,'2014-10-25',1415430224,'test',7,1,0),(35,10,'2014-09-30',1415433328,'周六',7,1,0),(36,26,'2014-10-11',1415589018,'下班忘记打卡',7,2,0),(37,27,'2014-11-05',1415589691,'正常',7,1,0),(38,31,'2014-09-30',1415602456,'请假事由',7,-1,0),(39,31,'2014-10-21',1415602559,'请假事由',7,-1,0),(40,32,'2014-11-01',1415602894,'正常',7,-1,0),(41,32,'2014-11-01',1415603907,'正常',7,-1,0),(42,32,'2014-11-01',1415604558,'1',6,-1,0),(43,32,'2014-11-08',1415604696,'1',6,-1,0),(44,32,'2014-10-20',1415607326,'1',6,-1,0),(45,31,'2014-11-03',1415607684,'原来考勤结果是 旷工，  然后 补假，  考勤变为 请假了，  然后再销假',7,-1,0),(46,31,'2014-09-30',1415609393,'更正理由更正理由更正理由',7,-1,0),(47,31,'2014-10-13',1415609548,'运营支',7,-1,0),(48,31,'2014-09-27',1415609711,'更正理由更正理由更正理由',7,-1,0),(49,31,'2014-09-27',1415611316,'正理由正理由正理由',7,-1,0);
/*!40000 ALTER TABLE `yy_attendance_apply` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_attendance_date`
--

DROP TABLE IF EXISTS `yy_attendance_date`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_attendance_date` (
  `sid` int(10) unsigned NOT NULL COMMENT '配置ID',
  `workday` date NOT NULL COMMENT '工作的日期',
  UNIQUE KEY `workday` (`workday`),
  KEY `attendance_date_sid` (`sid`),
  CONSTRAINT `attendance_date_sid` FOREIGN KEY (`sid`) REFERENCES `yy_attendance_setting` (`sid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='考勤配置日期表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_attendance_date`
--

LOCK TABLES `yy_attendance_date` WRITE;
/*!40000 ALTER TABLE `yy_attendance_date` DISABLE KEYS */;
INSERT INTO `yy_attendance_date` VALUES (1,'2014-09-24'),(1,'2014-09-25'),(1,'2014-09-26'),(1,'2014-09-27'),(1,'2014-09-29'),(1,'2014-09-30'),(1,'2014-10-06'),(1,'2014-10-07'),(1,'2014-10-08'),(1,'2014-10-09'),(1,'2014-10-10'),(1,'2014-10-11'),(1,'2014-10-13'),(1,'2014-10-14'),(1,'2014-10-15'),(1,'2014-10-16'),(1,'2014-10-17'),(1,'2014-10-18'),(1,'2014-10-20'),(1,'2014-10-21'),(1,'2014-10-22'),(1,'2014-10-23'),(1,'2014-10-24'),(1,'2014-10-25'),(1,'2014-10-27'),(1,'2014-10-28'),(1,'2014-10-29'),(1,'2014-10-30'),(1,'2014-10-31'),(1,'2014-11-01'),(1,'2014-11-03'),(1,'2014-11-04'),(1,'2014-11-05'),(1,'2014-11-06'),(1,'2014-11-07'),(1,'2014-11-08'),(1,'2014-11-10'),(1,'2014-11-11'),(1,'2014-11-12'),(1,'2014-11-13'),(1,'2014-11-14'),(1,'2014-11-15'),(1,'2014-11-17'),(1,'2014-11-18'),(1,'2014-11-19'),(1,'2014-11-20'),(1,'2014-11-21'),(1,'2014-11-22'),(1,'2014-11-24'),(1,'2014-11-25'),(1,'2014-11-26'),(1,'2014-11-27'),(1,'2014-11-28'),(1,'2014-11-29'),(1,'2014-12-01'),(1,'2014-12-02'),(1,'2014-12-03'),(1,'2014-12-04'),(1,'2014-12-05'),(1,'2014-12-06'),(1,'2014-12-08'),(1,'2014-12-09'),(1,'2014-12-10'),(1,'2014-12-11'),(1,'2014-12-12'),(1,'2014-12-13'),(1,'2014-12-15'),(1,'2014-12-16'),(1,'2014-12-17'),(1,'2014-12-18'),(1,'2014-12-19'),(1,'2014-12-20'),(1,'2014-12-22'),(1,'2014-12-23'),(1,'2014-12-24'),(1,'2014-12-25'),(1,'2014-12-26'),(1,'2014-12-27'),(1,'2014-12-29'),(1,'2014-12-30'),(1,'2014-12-31');
/*!40000 ALTER TABLE `yy_attendance_date` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_attendance_deduct`
--

DROP TABLE IF EXISTS `yy_attendance_deduct`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_attendance_deduct` (
  `did` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `sid` int(10) unsigned NOT NULL COMMENT '薪水ID',
  `money` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '扣除的金额',
  `reason` varchar(200) NOT NULL DEFAULT '' COMMENT '扣除的原因',
  `effect` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1有用 2被修改为无用',
  `workday` date NOT NULL COMMENT '工作的日期',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1请假 2未签到 3迟到 4早退 5未签退 6旷工(未签到签退) 7正常 8旷工半天 9迟到早退 10旷半天早退 11商务外出',
  PRIMARY KEY (`did`),
  KEY `attendance_deduct_sid` (`sid`),
  CONSTRAINT `attendance_deduct_sid` FOREIGN KEY (`sid`) REFERENCES `yy_member_salary` (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=1024 DEFAULT CHARSET=utf8 COMMENT='考勤扣款表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_attendance_deduct`
--

LOCK TABLES `yy_attendance_deduct` WRITE;
/*!40000 ALTER TABLE `yy_attendance_deduct` DISABLE KEYS */;
INSERT INTO `yy_attendance_deduct` VALUES (685,9,181.00,'由于旷工一天扣除181元.(注:应到22天)',1,'2014-09-27',6),(686,9,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-29 10:12,当月迟到第1次)',1,'2014-09-29',3),(687,9,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-06 10:52,当月迟到第2次)',1,'2014-10-06',3),(688,9,90.00,'由于未签到扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-07',2),(689,9,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-08 10:31,当月迟到第3次)',1,'2014-10-08',3),(690,9,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-10',5),(691,9,181.00,'由于旷工一天扣除181元.(注:应到22天)',1,'2014-10-11',6),(692,9,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-14 10:19,当月迟到第4次)',1,'2014-10-14',3),(693,9,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-16',5),(694,9,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-17',5),(695,9,90.00,'由于未签到扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-18',2),(696,9,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-22',8),(697,9,120.00,'旷工半天扣除90元,早退扣除30元(注:签退时间2014-10-25 16:24)',1,'2014-10-25',10),(698,10,155.00,'旷工半天扣除125元,早退扣除30元(注:签退时间2014-09-27 15:10)',1,'2014-09-27',10),(699,10,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-06 10:11,当月迟到第1次)',1,'2014-10-06',3),(700,10,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-09 10:33,当月迟到第2次)',1,'2014-10-09',3),(701,10,125.00,'由于未签退扣除125元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除250元)',1,'2014-10-10',5),(702,10,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-11',6),(703,10,250.00,'由于请了整天假扣除250元',1,'2014-10-13',1),(704,10,155.00,'旷工半天扣除125元,早退扣除30元(注:签退时间2014-10-18 15:30)',1,'2014-10-18',10),(705,10,250.00,'由于请了整天假扣除250元(注:当天请事假扣除3倍工资)',1,'2014-10-21',1),(706,10,155.00,'旷工半天扣除125元,早退扣除30元(注:签退时间2014-10-25 15:56)',1,'2014-10-25',10),(707,11,113.00,'由于旷工半天扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-09-27',8),(708,11,113.00,'由于旷工半天扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-11',8),(709,11,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-15 10:29,当月迟到第1次)',1,'2014-10-15',3),(710,11,113.00,'由于旷工半天扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-18',8),(711,11,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-24 10:19,当月迟到第2次)',1,'2014-10-24',3),(712,11,113.00,'由于旷工半天扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-25',8),(713,12,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-09 10:12,当月迟到第1次)',1,'2014-10-09',3),(714,12,102.00,'由于旷工半天扣除102元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除204元)',1,'2014-10-10',8),(715,12,102.00,'由于旷工半天扣除102元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除204元)',1,'2014-10-11',8),(716,12,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-14 10:52,当月迟到第2次)',1,'2014-10-14',3),(717,12,102.00,'由于未签退扣除102元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除204元)',1,'2014-10-16',5),(718,12,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-17 10:11,当月迟到第3次)',1,'2014-10-17',3),(719,12,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-24 10:26,当月迟到第4次)',1,'2014-10-24',3),(720,12,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-25 10:21,当月迟到第5次)',1,'2014-10-25',3),(721,13,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:16,当月迟到第1次)',1,'2014-10-25',3),(722,14,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-06',5),(723,14,159.00,'由于旷工一天扣除159元.(注:应到22天)',1,'2014-10-10',6),(724,14,79.00,'由于旷工半天扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-11',8),(725,14,79.00,'由于未签到扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-13',2),(726,14,79.00,'由于未签到扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-14',2),(727,14,79.00,'由于旷工半天扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-18',8),(728,14,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-22',5),(729,14,79.00,'由于旷工半天扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-25',8),(730,15,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-26 10:12,当月迟到第1次)',1,'2014-09-26',3),(731,15,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-30 10:56,当月迟到第2次)',1,'2014-09-30',3),(732,15,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-10',5),(733,15,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-11 10:38,当月迟到第3次)',1,'2014-10-11',3),(734,15,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-14 10:52,当月迟到第4次)',1,'2014-10-14',3),(735,15,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-16 10:14,当月迟到第5次)',1,'2014-10-16',3),(736,15,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-23 10:49,当月迟到第6次)',1,'2014-10-23',3),(737,15,68.00,'由于旷工半天扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-24',8),(738,15,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-25 10:55,当月迟到第7次)',1,'2014-10-25',3),(739,16,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-26 10:18,当月迟到第1次)',1,'2014-09-26',3),(740,16,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-09-30',6),(741,16,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-06',6),(742,16,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-07',6),(743,16,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-08',6),(744,16,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-09',6),(745,16,113.00,'由于未签退扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-10',5),(746,16,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-11 10:56,当月迟到第2次)',1,'2014-10-11',3),(747,16,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-14 10:17,当月迟到第3次)',1,'2014-10-14',3),(748,16,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-18 10:25,当月迟到第4次)',1,'2014-10-18',3),(749,16,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-21 10:18,当月迟到第5次)',1,'2014-10-21',3),(750,16,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-22 10:14,当月迟到第6次)',1,'2014-10-22',3),(751,16,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-23 10:14,当月迟到第7次)',1,'2014-10-23',3),(752,16,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-24 10:36,当月迟到第8次)',1,'2014-10-24',3),(753,16,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-25 10:17,当月迟到第9次)',1,'2014-10-25',3),(754,17,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-26 10:16,当月迟到第1次)',1,'2014-09-26',3),(755,17,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-27 10:33,当月迟到第2次)',1,'2014-09-27',3),(756,17,30.00,'迟到扣除30元(注:当天签到的时间为2014-09-29 10:18,当月迟到第3次)',1,'2014-09-29',3),(757,17,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-07',5),(758,17,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-08',8),(759,17,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-09',5),(760,17,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-11 10:49,当月迟到第4次)',1,'2014-10-11',3),(761,17,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-13 10:15,当月迟到第5次)',1,'2014-10-13',3),(762,17,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-14 10:20,当月迟到第6次)',1,'2014-10-14',3),(763,17,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-15 10:12,当月迟到第7次)',1,'2014-10-15',3),(764,17,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-17 10:20,当月迟到第8次)',1,'2014-10-17',3),(765,17,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-18',8),(766,17,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-20 10:14,当月迟到第9次)',1,'2014-10-20',3),(767,17,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-22 10:20,当月迟到第10次)',1,'2014-10-22',3),(768,17,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-25 10:33,当月迟到第11次)',1,'2014-10-25',3),(769,1,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-11',8),(770,1,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-13 10:20,当月迟到第1次)',1,'2014-10-13',3),(771,1,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-15 10:17,当月迟到第2次)',1,'2014-10-15',3),(772,1,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-18',8),(773,1,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-25',8),(774,18,125.00,'由于未签退扣除125元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除250元)',1,'2014-09-26',5),(775,18,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-27 10:49,当月迟到第1次)',1,'2014-09-27',3),(776,18,125.00,'由于未签退扣除125元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除250元)',1,'2014-09-30',5),(777,18,125.00,'由于未签退扣除125元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除250元)',1,'2014-10-10',5),(778,18,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:16,当月迟到第2次)',1,'2014-10-25',3),(779,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-09-26',6),(780,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-09-27',6),(781,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-09-29',6),(782,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-09-30',6),(783,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-06',6),(784,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-07',6),(785,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-08',6),(786,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-09',6),(787,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-10',6),(788,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-11',6),(789,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-13',6),(790,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-14',6),(791,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-15',6),(792,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-16',6),(793,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-17',6),(794,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-18',6),(795,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-20',6),(796,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-21',6),(797,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-22',6),(798,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-23',6),(799,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-24',6),(800,19,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-25',6),(801,20,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-27 10:14,当月迟到第1次)',1,'2014-09-27',3),(802,20,30.00,'早退扣除30元(注:当天签退的时间为2014-09-29 12:29)',1,'2014-09-29',4),(803,20,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-30',6),(804,20,68.00,'由于未签到扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-07',2),(805,20,68.00,'由于旷工半天扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-11',8),(806,20,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-13 10:12,当月迟到第2次)',1,'2014-10-13',3),(807,20,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-18 10:40,当月迟到第3次)',1,'2014-10-18',3),(808,20,68.00,'由于未签到扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-24',2),(809,20,98.00,'旷工半天扣除68元,早退扣除30元(注:签退时间2014-10-25 15:09)',1,'2014-10-25',10),(810,21,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-09-26',5),(811,21,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-21 10:24,当月迟到第1次)',1,'2014-10-21',3),(812,21,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:15,当月迟到第2次)',1,'2014-10-25',3),(813,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-26',6),(814,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-27',6),(815,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-29',6),(816,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-30',6),(817,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-06',6),(818,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-07',6),(819,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-08',6),(820,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-09',6),(821,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-10',6),(822,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-11',6),(823,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-13',6),(824,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-14',6),(825,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-15',6),(826,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-16',6),(827,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-17',6),(828,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-18',6),(829,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-20',6),(830,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-21',6),(831,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-22',6),(832,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-23',6),(833,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-24',6),(834,22,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-25',6),(835,23,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-26 10:13,当月迟到第1次)',1,'2014-09-26',3),(836,23,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-27 10:22,当月迟到第2次)',1,'2014-09-27',3),(837,23,30.00,'迟到扣除30元(注:当天签到的时间为2014-09-30 10:11,当月迟到第3次)',1,'2014-09-30',3),(838,23,68.00,'由于旷工半天扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-08',8),(839,23,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-10',5),(840,23,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-13',5),(841,23,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-14 10:13,当月迟到第4次)',1,'2014-10-14',3),(842,23,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-15 10:16,当月迟到第5次)',1,'2014-10-15',3),(843,23,30.00,'早退扣除30元(注:当天签退的时间为2014-10-16 18:24)',1,'2014-10-16',4),(844,23,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-25',5),(845,2,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-07',6),(846,2,113.00,'由于未签退扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-10',5),(847,2,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-14',6),(848,2,113.00,'由于未签到扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-18',2),(849,2,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:16,当月迟到第1次)',1,'2014-10-25',3),(850,24,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-10',5),(851,24,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:16,当月迟到第1次)',1,'2014-10-25',3),(852,25,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:15,当月迟到第1次)',1,'2014-10-25',3),(853,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-09-26',6),(854,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-09-27',6),(855,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-09-29',6),(856,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-09-30',6),(857,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-06',6),(858,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-07',6),(859,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-08',6),(860,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-09',6),(861,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-10',6),(862,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-11',6),(863,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-13',6),(864,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-14',6),(865,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-15',6),(866,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-16',6),(867,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-17',6),(868,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-18',6),(869,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-20',6),(870,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-21',6),(871,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-22',6),(872,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-23',6),(873,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-24',6),(874,26,250.00,'由于旷工一天扣除250元.(注:应到22天)',1,'2014-10-25',6),(875,3,30.00,'早退扣除30元(注:当天签退的时间为2014-09-30 17:17)',1,'2014-09-30',4),(876,3,204.00,'由于旷工一天扣除204元.(注:应到22天)',1,'2014-10-11',6),(877,3,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:15,当月迟到第1次)',1,'2014-10-25',3),(878,27,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-26',6),(879,27,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-27',6),(880,27,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-11',6),(881,27,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-23',6),(882,27,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:43,当月迟到第1次)',1,'2014-10-25',3),(883,4,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-11',5),(884,4,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:17,当月迟到第1次)',1,'2014-10-25',3),(885,5,136.00,'由于请了整天假扣除136元',1,'2014-10-08',1),(886,5,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:15,当月迟到第1次)',1,'2014-10-25',3),(887,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-26',6),(888,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-27',6),(889,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-29',6),(890,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-30',6),(891,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-06',6),(892,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-07',6),(893,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-08',6),(894,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-09',6),(895,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-10',6),(896,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-11',6),(897,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-13',6),(898,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-14',6),(899,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-15',6),(900,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-16',6),(901,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-17',6),(902,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-18',6),(903,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-20',6),(904,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-21',6),(905,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-22',6),(906,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-23',6),(907,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-24',6),(908,28,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-25',6),(909,29,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-07',6),(910,29,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-08',6),(911,29,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-11',6),(912,29,30.00,'早退扣除30元(注:当天签退的时间为2014-10-18 18:18)',1,'2014-10-18',4),(913,29,227.00,'由于旷工一天扣除227元.(注:应到22天)',1,'2014-10-23',6),(914,29,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:16,当月迟到第1次)',1,'2014-10-25',3),(915,30,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-07',5),(916,30,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-16',5),(917,30,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:16,当月迟到第1次)',1,'2014-10-25',3),(918,31,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-09-26',8),(919,31,90.00,'由于未签到扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-09-29',2),(920,31,181.00,'由于旷工一天扣除181元.(注:应到22天)',1,'2014-09-30',6),(921,31,30.00,'迟到(1)扣除0元,早退扣除30元,总扣除30元(注:签到时间2014-10-06 10:49签退时间2014-10-06 18:26)',1,'2014-10-06',9),(922,31,30.00,'早退扣除30元(注:当天签退的时间为2014-10-07 16:52)',1,'2014-10-07',4),(923,31,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-08',8),(924,31,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-09 10:16,当月迟到第2次)',1,'2014-10-09',3),(925,31,90.00,'由于未签到扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-10',2),(926,31,181.00,'由于请了整天假扣除181元',1,'2014-10-11',1),(927,31,90.00,'由于未签到扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-13',2),(928,31,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-15 10:53,当月迟到第3次)',1,'2014-10-15',3),(929,31,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-16 10:39,当月迟到第4次)',1,'2014-10-16',3),(930,31,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-17',5),(931,31,90.00,'由于旷工半天扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-18',8),(932,31,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-21 10:33,当月迟到第5次)',1,'2014-10-21',3),(933,31,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-22 10:30,当月迟到第6次)',1,'2014-10-22',3),(934,31,50.00,'迟到扣除50元(注:当天签到的时间为2014-10-23 10:43,当月迟到第7次)',1,'2014-10-23',3),(935,31,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-24 10:22,当月迟到第8次)',1,'2014-10-24',3),(936,31,90.00,'由于未签退扣除90元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除181元)',1,'2014-10-25',5),(937,32,22727.00,'由于未签退扣除22727元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除45454元)',1,'2014-09-29',5),(938,32,22727.00,'由于未签退扣除22727元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除45454元)',1,'2014-09-30',5),(939,32,22727.00,'由于未签退扣除22727元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除45454元)',1,'2014-10-06',5),(940,32,22727.00,'由于未签退扣除22727元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除45454元)',1,'2014-10-07',5),(941,32,22727.00,'由于未签到扣除22727元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除45454元)',1,'2014-10-08',2),(942,32,22727.00,'由于未签退扣除22727元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除45454元)',1,'2014-10-15',5),(943,32,22727.00,'由于未签退扣除22727元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除45454元)',1,'2014-10-16',5),(944,32,45454.00,'由于旷工一天扣除45454元.(注:应到22天)',1,'2014-10-20',6),(945,32,45454.00,'由于旷工一天扣除45454元.(注:应到22天)',1,'2014-10-25',6),(946,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-09-26',6),(947,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-09-27',6),(948,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-09-29',6),(949,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-09-30',6),(950,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-06',6),(951,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-07',6),(952,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-08',6),(953,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-09',6),(954,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-10',6),(955,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-11',6),(956,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-13',6),(957,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-14',6),(958,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-15',6),(959,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-16',6),(960,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-17',6),(961,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-18',6),(962,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-20',6),(963,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-21',6),(964,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-22',6),(965,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-23',6),(966,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-24',6),(967,33,454545.00,'由于旷工一天扣除454545元.(注:应到22天)',1,'2014-10-25',6),(968,34,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-09-30',5),(969,34,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-07',6),(970,34,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-10',5),(971,34,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-11 10:14,当月迟到第1次)',1,'2014-10-11',3),(972,34,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-13 10:12,当月迟到第2次)',1,'2014-10-13',3),(973,34,136.00,'由于请了整天假扣除136元',1,'2014-10-18',1),(974,34,60.00,'迟到(3)扣除30元,早退扣除30元,总扣除60元(注:签到时间2014-10-25 10:17签退时间2014-10-25 18:20)',1,'2014-10-25',9),(975,35,159.00,'由于旷工一天扣除159元.(注:应到22天)',1,'2014-09-27',6),(976,35,30.00,'早退扣除30元(注:当天签退的时间为2014-10-07 17:57)',1,'2014-10-07',4),(977,35,159.00,'由于旷工一天扣除159元.(注:应到22天)',1,'2014-10-11',6),(978,35,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-13',5),(979,35,30.00,'早退扣除30元(注:当天签退的时间为2014-10-14 10:15)',1,'2014-10-14',4),(980,35,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-16',5),(981,35,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-17',5),(982,35,159.00,'由于旷工一天扣除159元.(注:应到22天)',1,'2014-10-18',6),(983,35,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-21 10:11,当月迟到第1次)',1,'2014-10-21',3),(984,35,79.00,'由于未签退扣除79元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除159元)',1,'2014-10-24',5),(985,35,30.00,'迟到(2)扣除0元,早退扣除30元,总扣除30元(注:签到时间2014-10-25 10:41签退时间2014-10-25 15:41)',1,'2014-10-25',9),(986,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-26',6),(987,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-27',6),(988,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-29',6),(989,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-09-30',6),(990,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-06',6),(991,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-07',6),(992,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-08',6),(993,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-09',6),(994,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-10',6),(995,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-11',6),(996,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-13',6),(997,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-14',6),(998,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-15',6),(999,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-16',6),(1000,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-17',6),(1001,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-18',6),(1002,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-20',6),(1003,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-21',6),(1004,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-22',6),(1005,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-23',6),(1006,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-24',6),(1007,36,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-25',6),(1008,37,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-09-29',5),(1009,37,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-06',6),(1010,37,136.00,'由于旷工一天扣除136元.(注:应到22天)',1,'2014-10-07',6),(1011,37,68.00,'由于旷工半天扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-08',8),(1012,37,68.00,'由于未签退扣除68元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除136元)',1,'2014-10-10',5),(1013,37,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:15,当月迟到第1次)',1,'2014-10-25',3),(1014,38,113.00,'由于未签退扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-10',5),(1015,38,113.00,'由于未签退扣除113元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除227元)',1,'2014-10-24',5),(1016,38,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:20,当月迟到第1次)',1,'2014-10-25',3),(1017,39,136.00,'由于请了整天假扣除136元',1,'2014-10-10',1),(1018,39,136.00,'由于请了整天假扣除136元(注:当天请事假扣除3倍工资)',1,'2014-10-11',1),(1019,39,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-25 10:15,当月迟到第1次)',1,'2014-10-25',3),(1020,159,0.00,'迟到扣除0元(注: 当天签到的时间为2014-09-27 10:18,当月迟到第1次)',1,'2014-09-27',3),(1021,159,0.00,'迟到扣除0元(注: 当天签到的时间为2014-10-11 10:11,当月迟到第2次)',1,'2014-10-11',3),(1022,159,30.00,'迟到扣除30元(注:当天签到的时间为2014-10-18 10:23,当月迟到第3次)',1,'2014-10-18',3),(1023,159,0.00,'由于旷工半天扣除0元.(注:应到22天,未签到或签退算旷半天,旷工一天扣除0元)',1,'2014-10-25',8);
/*!40000 ALTER TABLE `yy_attendance_deduct` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_attendance_department`
--

DROP TABLE IF EXISTS `yy_attendance_department`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_attendance_department` (
  `sid` int(10) unsigned NOT NULL COMMENT '配置ID',
  `did` int(10) unsigned NOT NULL COMMENT '部门ID',
  PRIMARY KEY (`sid`,`did`),
  KEY `attendance_department_did` (`did`),
  CONSTRAINT `attendance_department_did` FOREIGN KEY (`did`) REFERENCES `yy_department` (`did`),
  CONSTRAINT `attendance_department_sid` FOREIGN KEY (`sid`) REFERENCES `yy_attendance_setting` (`sid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='考勤配置部门表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_attendance_department`
--

LOCK TABLES `yy_attendance_department` WRITE;
/*!40000 ALTER TABLE `yy_attendance_department` DISABLE KEYS */;
INSERT INTO `yy_attendance_department` VALUES (1,1),(1,2),(1,3),(1,4),(1,5),(1,7),(1,8);
/*!40000 ALTER TABLE `yy_attendance_department` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_attendance_setting`
--

DROP TABLE IF EXISTS `yy_attendance_setting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_attendance_setting` (
  `sid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '配置ID',
  `name` varchar(200) NOT NULL COMMENT '规则名称',
  `daystart` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '几号开始',
  `dayend` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '几号结束',
  `timestart` mediumint(5) unsigned NOT NULL DEFAULT '0' COMMENT '每天几点开始',
  `timeend` mediumint(5) unsigned NOT NULL DEFAULT '0' COMMENT '每天几点结束',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '1在用 0停用',
  PRIMARY KEY (`sid`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8 COMMENT='考勤配置表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_attendance_setting`
--

LOCK TABLES `yy_attendance_setting` WRITE;
/*!40000 ALTER TABLE `yy_attendance_setting` DISABLE KEYS */;
INSERT INTO `yy_attendance_setting` VALUES (1,'所有部门的规则',26,25,36000,68400,1);
/*!40000 ALTER TABLE `yy_attendance_setting` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_department`
--

DROP TABLE IF EXISTS `yy_department`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_department` (
  `did` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '部门ID',
  `name` varchar(200) NOT NULL DEFAULT '' COMMENT '名称',
  `pdid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '上级部门ID',
  `manager` varchar(60) NOT NULL DEFAULT '' COMMENT '负责人名称',
  `phone` varchar(12) NOT NULL DEFAULT '' COMMENT '部门电话',
  `showorder` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '显示顺序',
  PRIMARY KEY (`did`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 COMMENT='部门表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_department`
--

LOCK TABLES `yy_department` WRITE;
/*!40000 ALTER TABLE `yy_department` DISABLE KEYS */;
INSERT INTO `yy_department` VALUES (1,'总办',0,'肖道曦','18600060150',0),(2,'项目一部',1,'睢昕','13981933001',0),(3,'手游事业部',1,'江川','15928921315',0),(4,'美术部',1,'张超然','18681255118',0),(5,'技术部',1,'王之韦','11111111111',0),(7,'运营支持部',1,'宋延生','18628246627',0),(8,'综合部',1,'张晶莹','13880902615',0),(9,'炊事班',1,'12','028-85000000',0),(15,'销售部',1,'张三','123',0),(17,'营销部',1,'张三','123',0),(20,'123部门',1,'123','123',0);
/*!40000 ALTER TABLE `yy_department` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member`
--

DROP TABLE IF EXISTS `yy_member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member` (
  `uid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `username` varchar(60) NOT NULL DEFAULT '' COMMENT '用户名称',
  `password` varchar(64) NOT NULL DEFAULT '' COMMENT '用户密码',
  `did` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '所属部门ID',
  `pid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '职位ID',
  `role` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1试用员工 2实习员工 3正式员工 4离职员工',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1就职 2离职',
  `groupid` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '管理组ID,为0不能进入后台',
  PRIMARY KEY (`uid`),
  UNIQUE KEY `username` (`username`),
  KEY `member_did` (`did`),
  KEY `member_pid` (`pid`),
  CONSTRAINT `member_did` FOREIGN KEY (`did`) REFERENCES `yy_department` (`did`),
  CONSTRAINT `member_pid` FOREIGN KEY (`pid`) REFERENCES `yy_position` (`pid`)
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8 COMMENT='员工表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member`
--

LOCK TABLES `yy_member` WRITE;
/*!40000 ALTER TABLE `yy_member` DISABLE KEYS */;
INSERT INTO `yy_member` VALUES (1,'肖道曦','e10adc3949ba59abbe56e057f20f883e',1,1,3,1,1),(2,'梁雨','2e45bfe2949cfebb24d4484b8350480f',1,2,3,1,1),(3,'睢昕','e10adc3949ba59abbe56e057f20f883e',2,3,3,1,1),(4,'杨志祥','e10adc3949ba59abbe56e057f20f883e',2,5,3,1,0),(5,'吴浩','e10adc3949ba59abbe56e057f20f883e',2,6,3,1,0),(6,'胡松','e10adc3949ba59abbe56e057f20f883e',2,6,3,1,0),(7,'张顺昌','e10adc3949ba59abbe56e057f20f883e',2,15,3,1,0),(8,'姜婷','e10adc3949ba59abbe56e057f20f883e',2,14,2,1,0),(9,'焦捷','1444a477e1c438f57e6573dca0565070',2,5,3,1,0),(10,'王鹏程','e10adc3949ba59abbe56e057f20f883e',2,7,3,1,0),(11,'李笑伊','e10adc3949ba59abbe56e057f20f883e',2,7,3,1,0),(12,'易宇良','e10adc3949ba59abbe56e057f20f883e',2,7,3,1,0),(13,'张超然','e10adc3949ba59abbe56e057f20f883e',4,4,3,1,0),(14,'丁涛','64dbf6a9fcc8ff5590adfa4fb431d529',4,4,3,1,0),(15,'叶世尊','e10adc3949ba59abbe56e057f20f883e',4,13,3,1,0),(16,'钟林芝','e10adc3949ba59abbe56e057f20f883e',4,12,3,1,0),(17,'刘春清','e10adc3949ba59abbe56e057f20f883e',2,12,3,1,0),(18,'江川','e10adc3949ba59abbe56e057f20f883e',3,3,3,1,1),(19,'王超','e10adc3949ba59abbe56e057f20f883e',3,5,3,1,0),(20,'高潮','e10adc3949ba59abbe56e057f20f883e',3,6,3,1,0),(21,'任驰宇','e10adc3949ba59abbe56e057f20f883e',3,6,3,1,0),(22,'白发川','1d3a3c47f8d606d88ce63e643d60702d',3,6,3,1,0),(23,'唐珏','e10adc3949ba59abbe56e057f20f883e',3,7,3,1,0),(24,'徐涛','e10adc3949ba59abbe56e057f20f883e',3,6,3,1,0),(25,'刘明圆','b55c32674cdb7aca000d445992f355a9',3,8,3,1,0),(26,'黄维','e10adc3949ba59abbe56e057f20f883e',3,11,3,1,1),(27,'刘勇','e10adc3949ba59abbe56e057f20f883e',3,6,3,1,1),(28,'王之韦','e10adc3949ba59abbe56e057f20f883e',5,5,3,1,0),(29,'谢佳奕','88d33877f3b347b9df76ad930565ac7b',3,8,3,1,0),(30,'何聪','e10adc3949ba59abbe56e057f20f883e',4,13,3,1,0),(31,'宋延生','40a5f56c32b0f7427a496aa29bbcc33e',7,5,3,1,0),(32,'李孟洋','e10adc3949ba59abbe56e057f20f883e',7,9,3,1,0),(33,'朱盛勇','e10adc3949ba59abbe56e057f20f883e',7,9,3,1,0),(34,'廖胡东','e10adc3949ba59abbe56e057f20f883e',7,9,3,1,0),(35,'张晶莹','e10adc3949ba59abbe56e057f20f883e',8,4,3,1,1),(36,'杨勇','e10adc3949ba59abbe56e057f20f883e',8,10,3,1,0),(37,'李生茂','e10adc3949ba59abbe56e057f20f883e',3,6,3,1,0),(38,'罗子恒','e10adc3949ba59abbe56e057f20f883e',2,7,3,1,0),(39,'秦路燕','e10adc3949ba59abbe56e057f20f883e',2,7,3,1,1),(40,'李飞翔','e10adc3949ba59abbe56e057f20f883e',4,12,1,1,0),(43,'123','e10adc3949ba59abbe56e057f20f883e',20,10,1,1,0);
/*!40000 ALTER TABLE `yy_member` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_affair`
--

DROP TABLE IF EXISTS `yy_member_affair`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_affair` (
  `uid` int(10) unsigned NOT NULL COMMENT '用户ID',
  `need_apply` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '申请中的事项',
  `apply` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '申请完毕的事项',
  `need_examine` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '待审批的事项',
  `examine` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '已经审批的事项',
  `need_deal` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '待处理的事项',
  `deal` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '已经处理的事项',
  KEY `member_affair_uid` (`uid`),
  CONSTRAINT `member_affair_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='事务统计表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_affair`
--

LOCK TABLES `yy_member_affair` WRITE;
/*!40000 ALTER TABLE `yy_member_affair` DISABLE KEYS */;
INSERT INTO `yy_member_affair` VALUES (1,0,1,24,30,0,0),(2,0,0,1,0,0,0),(3,0,0,3,14,0,0),(4,1,0,0,0,0,0),(5,1,8,0,1,3,3),(6,0,0,0,0,0,0),(7,11,3,1,1,2,0),(8,1,3,0,0,2,1),(9,0,0,0,0,0,0),(10,1,0,0,0,0,0),(11,0,0,0,0,0,0),(12,0,0,0,0,0,0),(13,0,0,0,0,0,0),(14,0,0,0,0,0,0),(15,0,0,0,0,0,0),(16,0,0,0,0,0,0),(17,0,0,0,0,0,0),(18,0,1,4,12,0,0),(19,0,0,0,0,0,0),(20,0,0,0,0,0,0),(21,0,0,0,0,0,0),(22,2,0,0,0,0,0),(23,0,0,0,0,0,0),(24,0,0,0,0,0,0),(25,0,0,0,0,0,0),(26,1,4,0,0,0,1),(27,3,6,0,0,4,2),(28,0,0,0,0,0,0),(29,0,0,0,0,0,0),(30,0,1,0,0,0,0),(31,1,12,0,17,1,0),(32,1,21,2,0,10,3),(33,0,0,0,0,0,0),(34,2,5,0,0,3,2),(35,1,1,0,3,0,0),(36,0,0,0,0,0,0),(37,3,0,0,0,0,0),(38,0,0,0,0,0,0),(39,6,12,0,0,3,1),(40,0,0,0,0,0,0),(43,0,0,0,0,0,0);
/*!40000 ALTER TABLE `yy_member_affair` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_attendance`
--

DROP TABLE IF EXISTS `yy_member_attendance`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_attendance` (
  `aid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `uid` int(10) unsigned NOT NULL COMMENT '员工ID',
  `workday` date NOT NULL COMMENT '工作的日期',
  `workon` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '上班的时间',
  `workoff` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '下班的时间',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1请假 2未签到 3迟到 4早退 5未签退 6旷工(未签到签退) 7正常 8迟到+早退',
  PRIMARY KEY (`aid`),
  UNIQUE KEY `uid` (`uid`,`workday`),
  CONSTRAINT `member_attendance_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=5294 DEFAULT CHARSET=utf8 COMMENT='员工工作表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_attendance`
--

LOCK TABLES `yy_member_attendance` WRITE;
/*!40000 ALTER TABLE `yy_member_attendance` DISABLE KEYS */;
INSERT INTO `yy_member_attendance` VALUES (1,4,'2014-09-24',1411524780,1411569960,3),(2,5,'2014-09-24',1411524240,1411557060,7),(3,6,'2014-09-24',1411524300,1411560840,7),(4,7,'2014-09-24',1411524240,1411569960,7),(5,8,'2014-09-24',1411522200,1411557300,7),(6,9,'2014-09-24',0,1411563240,2),(7,10,'2014-09-24',0,0,6),(8,11,'2014-09-24',1411525440,1411563240,3),(9,12,'2014-09-24',1411524900,1411565040,3),(10,13,'2014-09-24',1411524000,1411558980,7),(11,14,'2014-09-24',1411523940,1411562340,7),(12,15,'2014-09-24',0,0,6),(13,16,'2014-09-24',0,1411556640,2),(14,17,'2014-09-24',1411523700,1411562340,7),(15,18,'2014-09-24',0,0,6),(16,19,'2014-09-24',1411523700,1411563480,7),(17,20,'2014-09-24',1411522260,1411563420,7),(18,21,'2014-09-24',1411524240,1411543380,4),(19,22,'2014-09-24',1411521960,1411560060,7),(20,23,'2014-09-24',0,0,6),(21,24,'2014-09-24',1411523640,1411558200,7),(22,25,'2014-09-24',1411523100,1411557240,7),(23,26,'2014-09-24',1411523700,1411557120,7),(24,27,'2014-09-24',1411521240,1411557120,7),(25,28,'2014-09-24',0,0,6),(26,29,'2014-09-24',0,0,6),(27,30,'2014-09-24',1411524000,1411557660,7),(28,31,'2014-09-24',0,0,6),(29,32,'2014-09-24',1411519500,1411563780,7),(30,33,'2014-09-24',0,0,6),(31,34,'2014-09-24',1411524240,1411564080,7),(32,35,'2014-09-24',1411523700,1411556280,7),(33,36,'2014-09-24',0,0,6),(34,37,'2014-09-24',1411522740,1411563120,7),(35,38,'2014-09-24',1411524600,1411565040,7),(36,39,'2014-09-24',1411522620,1411557180,7),(38,4,'2014-09-25',1411610220,1411647960,7),(39,5,'2014-09-25',1411610400,1411643880,7),(40,6,'2014-09-25',1411611300,1411643880,3),(41,7,'2014-09-25',1411614000,1411644720,3),(42,8,'2014-09-25',1411609320,1411644720,7),(43,9,'2014-09-25',1411610400,1411645440,7),(44,10,'2014-09-25',1411610580,1411648140,7),(45,11,'2014-09-25',1411610880,1411648560,7),(46,12,'2014-09-25',1411610640,1411653660,7),(47,13,'2014-09-25',1411610340,1411645440,7),(48,14,'2014-09-25',1411610100,0,5),(49,15,'2014-09-25',0,0,6),(50,16,'2014-09-25',1411610880,1411642920,7),(51,17,'2014-09-25',1411610220,1411651560,7),(52,18,'2014-09-25',0,0,6),(53,19,'2014-09-25',1411610940,1411652340,7),(54,20,'2014-09-25',0,0,6),(55,21,'2014-09-25',1411610400,1411652160,7),(56,22,'2014-09-25',1411608420,1411644900,7),(57,23,'2014-09-25',0,0,6),(58,24,'2014-09-25',1411609920,0,5),(59,25,'2014-09-25',1411610040,0,5),(60,26,'2014-09-25',0,0,6),(61,27,'2014-09-25',1411607820,1411644780,7),(62,28,'2014-09-25',0,0,6),(63,29,'2014-09-25',1411608900,1411653660,7),(64,30,'2014-09-25',1411610640,1411643820,7),(65,31,'2014-09-25',1411612380,1411645440,3),(66,32,'2014-09-25',1411605300,1411653300,7),(67,33,'2014-09-25',0,0,6),(68,34,'2014-09-25',1411610700,1411653660,7),(69,35,'2014-09-25',1411611000,1411642800,7),(70,36,'2014-09-25',0,0,6),(71,37,'2014-09-25',1411608960,1411646820,7),(72,38,'2014-09-25',1411609860,1411653600,7),(73,39,'2014-09-25',1411609380,1411643940,7),(75,4,'2014-09-26',1411697280,1411737720,7),(76,5,'2014-09-26',1411696740,1411729860,7),(77,6,'2014-09-26',1411696620,1411729800,7),(78,7,'2014-09-26',1411696980,1411730520,7),(79,8,'2014-09-26',1411694700,1411730220,7),(80,9,'2014-09-26',1411696980,1411733640,7),(81,10,'2014-09-26',1411697520,1411732260,3),(82,11,'2014-09-26',1411697880,1411732260,3),(83,12,'2014-09-26',1411697760,1411737180,3),(84,13,'2014-09-26',1411696980,1411733580,7),(85,14,'2014-09-26',1411696860,0,5),(86,15,'2014-09-26',0,0,6),(87,16,'2014-09-26',1411696380,1411729320,7),(88,17,'2014-09-26',1411696320,0,5),(89,18,'2014-09-26',0,0,6),(90,19,'2014-09-26',1411697580,1411733880,3),(91,20,'2014-09-26',1411695240,1411733340,7),(92,21,'2014-09-26',1411696320,1411738920,7),(93,22,'2014-09-26',1411693860,1411731120,7),(94,23,'2014-09-26',0,0,6),(95,24,'2014-09-26',1411697160,1411730040,7),(96,25,'2014-09-26',0,0,6),(97,26,'2014-09-26',1411696620,1411729860,7),(98,27,'2014-09-26',1411695900,1411729920,7),(99,28,'2014-09-26',0,0,6),(100,29,'2014-09-26',1411694340,1411732920,7),(101,30,'2014-09-26',1411697040,1411729860,7),(102,31,'2014-09-26',1411705680,1411730640,8),(103,32,'2014-09-26',1411691640,1411730220,7),(104,33,'2014-09-26',0,0,6),(105,34,'2014-09-26',1411697280,1411737180,7),(106,35,'2014-09-26',1411696260,1411729440,7),(107,36,'2014-09-26',0,0,6),(108,37,'2014-09-26',1411695540,1411734360,7),(109,38,'2014-09-26',1411695900,1411732260,7),(110,39,'2014-09-26',1411695960,1411729920,7),(112,4,'2014-09-27',0,0,6),(113,5,'2014-09-27',1411788120,1411801800,10),(114,6,'2014-09-27',1411792020,1411815840,8),(115,7,'2014-09-27',1411783200,1411819260,7),(116,8,'2014-09-27',1411780920,1411819200,7),(117,9,'2014-09-27',1411783680,1411818600,7),(118,10,'2014-09-27',1411783440,1411820700,7),(119,11,'2014-09-27',1411783440,1411820700,7),(120,12,'2014-09-27',1411785180,1411817400,3),(121,13,'2014-09-27',1411783380,1411818600,7),(122,14,'2014-09-27',1411786140,1411816140,3),(123,15,'2014-09-27',0,0,6),(124,16,'2014-09-27',1411784040,1411815780,3),(125,17,'2014-09-27',1411782960,1411816200,7),(126,18,'2014-09-27',0,0,6),(127,19,'2014-09-27',1411784520,1411816020,3),(128,20,'2014-09-27',1411781040,1411816980,7),(129,21,'2014-09-27',1411783260,1411816260,7),(130,22,'2014-09-27',1411780860,1411815060,7),(131,23,'2014-09-27',0,0,6),(132,24,'2014-09-27',1411780800,1411815060,7),(133,25,'2014-09-27',0,0,6),(134,26,'2014-09-27',1411783080,1411815000,7),(135,27,'2014-09-27',1411781640,1411815000,7),(136,28,'2014-09-27',0,0,6),(137,29,'2014-09-27',1411782600,1411815060,7),(138,30,'2014-09-27',1411782780,1411816140,7),(139,31,'2014-09-27',0,1411818600,7),(140,32,'2014-09-27',1411780860,1411819200,7),(141,33,'2014-09-27',0,0,6),(142,34,'2014-09-27',1411783560,1411819200,7),(143,35,'2014-09-27',0,0,6),(144,36,'2014-09-27',0,0,6),(145,37,'2014-09-27',1411781640,1411815720,7),(146,38,'2014-09-27',1411782960,1411824480,7),(147,39,'2014-09-27',1411782240,1411815120,7),(149,4,'2014-09-29',1411956720,1412005260,3),(150,5,'2014-09-29',1411956000,1411989360,7),(151,6,'2014-09-29',1411956000,1411989300,7),(152,7,'2014-09-29',1411956600,1412005320,7),(153,8,'2014-09-29',1411953300,1411990140,7),(154,9,'2014-09-29',1411956180,1411990800,7),(155,10,'2014-09-29',1411956240,1411990620,7),(156,11,'2014-09-29',1411956180,1411990560,7),(157,12,'2014-09-29',1411957080,1411997340,3),(158,13,'2014-09-29',1411956180,1411990800,7),(159,14,'2014-09-29',1411955880,1411997760,7),(160,15,'2014-09-29',0,0,6),(161,16,'2014-09-29',1411954500,1411964940,4),(162,17,'2014-09-29',1411955640,1411997760,7),(163,18,'2014-09-29',0,0,6),(164,19,'2014-09-29',1411955520,1411996920,7),(165,20,'2014-09-29',1411954320,1411996560,7),(166,21,'2014-09-29',1411956000,1411994580,7),(167,22,'2014-09-29',1411954080,1411988880,7),(168,23,'2014-09-29',0,0,6),(169,24,'2014-09-29',1411955460,1411989780,7),(170,25,'2014-09-29',1411955640,1411988460,7),(171,26,'2014-09-29',1411955820,1411989120,7),(172,27,'2014-09-29',1411953060,1411989120,7),(173,28,'2014-09-29',0,0,6),(174,29,'2014-09-29',1411954800,1411996320,7),(175,30,'2014-09-29',1411956000,1411990380,7),(176,31,'2014-09-29',0,1411990800,2),(177,32,'2014-09-29',1411950360,0,5),(178,33,'2014-09-29',0,0,6),(179,34,'2014-09-29',1411956240,1411997460,7),(180,35,'2014-09-29',1411956360,1411988640,7),(181,36,'2014-09-29',0,0,6),(182,37,'2014-09-29',1411954080,0,5),(183,38,'2014-09-29',1411955460,1411990800,7),(184,39,'2014-09-29',1411955340,1411988880,7),(186,4,'2014-09-30',1412041860,1412074860,7),(187,5,'2014-09-30',1412042100,1412074920,7),(188,6,'2014-09-30',1412042340,1412074920,7),(189,7,'2014-09-30',1412042760,1412075340,7),(190,8,'2014-09-30',1412042340,1412074980,7),(191,9,'2014-09-30',1412041980,1412076300,7),(192,10,'2014-09-30',1412045760,1412074920,3),(193,11,'2014-09-30',0,0,6),(194,12,'2014-09-30',1412044200,0,7),(195,13,'2014-09-30',1412042040,1412076300,7),(196,14,'2014-09-30',1412041860,0,5),(197,15,'2014-09-30',0,0,6),(198,16,'2014-09-30',0,0,6),(199,17,'2014-09-30',1412041680,1412076120,7),(200,18,'2014-09-30',0,0,6),(201,19,'2014-09-30',1412043060,1412076600,3),(202,20,'2014-09-30',1412040900,1412076480,7),(203,21,'2014-09-30',1412042400,1412076540,7),(204,22,'2014-09-30',1412041080,1412075160,7),(205,23,'2014-09-30',0,0,6),(206,24,'2014-09-30',1412041920,1412068620,4),(207,25,'2014-09-30',1412042160,1412075040,7),(208,26,'2014-09-30',1412042160,1412074860,7),(209,27,'2014-09-30',1412039400,1412074860,7),(210,28,'2014-09-30',0,0,6),(211,29,'2014-09-30',1412040720,1412075040,7),(212,30,'2014-09-30',1412042760,1412074920,7),(213,31,'2014-09-30',0,0,6),(214,32,'2014-09-30',1412039460,0,5),(215,33,'2014-09-30',0,0,6),(216,34,'2014-09-30',1412042760,0,5),(217,35,'2014-09-30',1412042640,1412075520,7),(218,36,'2014-09-30',0,0,6),(219,37,'2014-09-30',1412041140,1412076540,7),(220,38,'2014-09-30',1412042100,1412074980,7),(221,39,'2014-09-30',1412041500,1412075100,7),(223,4,'2014-10-06',1412563920,1412595180,3),(224,5,'2014-10-06',1412561460,1412594160,3),(225,6,'2014-10-06',1412560680,1412594160,7),(226,7,'2014-10-06',1412561220,1412593740,7),(227,8,'2014-10-06',1412560080,1412593500,7),(228,9,'2014-10-06',1412560260,0,5),(229,10,'2014-10-06',1412560500,1412593980,7),(230,11,'2014-10-06',0,0,6),(231,12,'2014-10-06',1412561220,1412597820,7),(232,13,'2014-10-06',1412560260,1412594220,7),(233,14,'2014-10-06',1412560920,1412596500,7),(234,15,'2014-10-06',0,0,6),(235,16,'2014-10-06',1412560560,1412593260,7),(236,17,'2014-10-06',1412560680,1412596500,7),(237,18,'2014-10-06',0,0,6),(238,19,'2014-10-06',1412560740,1412601540,7),(239,20,'2014-10-06',1412560440,1412601540,7),(240,21,'2014-10-06',1412560020,1412601660,7),(241,22,'2014-10-06',1412559900,1412594040,7),(242,23,'2014-10-06',0,0,6),(243,24,'2014-10-06',1412560320,1412593920,7),(244,25,'2014-10-06',1412559900,1412593320,7),(245,26,'2014-10-06',1412560560,1412593500,7),(246,27,'2014-10-06',1412560380,1412593500,7),(247,28,'2014-10-06',0,0,6),(248,29,'2014-10-06',1412559900,1412593260,7),(249,30,'2014-10-06',1412560920,1412594160,7),(250,31,'2014-10-06',1412563740,1412591160,9),(251,32,'2014-10-06',1412559960,0,5),(252,33,'2014-10-06',0,0,6),(253,34,'2014-10-06',1412561280,1412597880,7),(254,35,'2014-10-06',1412560560,1412595300,7),(255,36,'2014-10-06',0,0,6),(256,37,'2014-10-06',0,0,6),(257,38,'2014-10-06',1412559900,1412593740,7),(258,39,'2014-10-06',1412559900,1412593440,7),(260,4,'2014-10-07',0,1412658060,2),(261,5,'2014-10-07',1412647680,1412680260,7),(262,6,'2014-10-07',1412647500,1412680380,7),(263,7,'2014-10-07',1412647440,1412680080,7),(264,8,'2014-10-07',1412644200,1412679960,7),(265,9,'2014-10-07',1412646720,1412680440,7),(266,10,'2014-10-07',1412647680,1412679780,7),(267,11,'2014-10-07',0,0,6),(268,12,'2014-10-07',1412647080,0,5),(269,13,'2014-10-07',1412646720,1412680500,7),(270,14,'2014-10-07',1412646840,1412684220,7),(271,15,'2014-10-07',0,0,6),(272,16,'2014-10-07',0,1412679600,2),(273,17,'2014-10-07',1412646960,1412684220,7),(274,18,'2014-10-07',0,0,6),(275,19,'2014-10-07',1412647320,1412683620,7),(276,20,'2014-10-07',0,0,6),(277,21,'2014-10-07',1412646600,1412683680,7),(278,22,'2014-10-07',1412644800,1412681220,7),(279,23,'2014-10-07',0,0,6),(280,24,'2014-10-07',1412646480,1412677920,7),(281,25,'2014-10-07',1412647440,1412680620,7),(282,26,'2014-10-07',1412647140,1412680920,7),(283,27,'2014-10-07',1412644440,1412680920,7),(284,28,'2014-10-07',0,0,6),(285,29,'2014-10-07',0,0,6),(286,30,'2014-10-07',1412646720,0,5),(287,31,'2014-10-07',1412647260,1412671920,4),(288,32,'2014-10-07',1412643480,0,5),(289,33,'2014-10-07',0,0,6),(290,34,'2014-10-07',0,0,6),(291,35,'2014-10-07',1412645700,1412675820,4),(292,36,'2014-10-07',0,0,6),(293,37,'2014-10-07',0,0,6),(294,38,'2014-10-07',1412645340,1412679780,7),(295,39,'2014-10-07',1412646000,1412680020,7),(297,4,'2014-10-08',1412735460,1412775120,3),(298,5,'2014-10-08',1412734200,1412766780,7),(299,6,'2014-10-08',1412734020,1412766780,7),(300,7,'2014-10-08',1412733960,1412766840,7),(301,8,'2014-10-08',1412732100,1412766840,7),(302,9,'2014-10-08',1412733900,1412770320,7),(303,10,'2014-10-08',1412734020,1412770320,7),(304,11,'2014-10-08',0,0,6),(305,12,'2014-10-08',1412739480,1412776320,8),(306,13,'2014-10-08',1412733900,1412766540,7),(307,14,'2014-10-08',1412731680,1412767200,7),(308,15,'2014-10-08',0,0,6),(309,16,'2014-10-08',1412733060,1412766060,7),(310,17,'2014-10-08',1412733420,1412767200,7),(311,18,'2014-10-08',0,0,6),(312,19,'2014-10-08',1412741460,1412768040,8),(313,20,'2014-10-08',1412731620,1412772120,7),(314,21,'2014-10-08',1412733480,1412772240,7),(315,22,'2014-10-08',1412731860,1412767020,7),(316,23,'2014-10-08',0,0,6),(317,24,'2014-10-08',1412733480,1412766300,7),(318,25,'2014-10-08',1412732760,1412767140,7),(319,26,'2014-10-08',1412733480,1412766300,7),(320,27,'2014-10-08',1412732880,1412766300,1),(321,28,'2014-10-08',0,0,6),(322,29,'2014-10-08',0,0,6),(323,30,'2014-10-08',1412733780,1412766780,7),(324,31,'2014-10-08',1412737680,1412766540,8),(325,32,'2014-10-08',0,1412776320,2),(326,33,'2014-10-08',0,0,6),(327,34,'2014-10-08',1412734200,1412776380,7),(328,35,'2014-10-08',1412733900,1412766000,7),(329,36,'2014-10-08',0,0,6),(330,37,'2014-10-08',1412744340,1412770920,8),(331,38,'2014-10-08',1412733480,1412771220,7),(332,39,'2014-10-08',1412732100,1412766660,7),(334,4,'2014-10-09',1412820240,1412854860,7),(335,5,'2014-10-09',1412821980,1412853540,3),(336,6,'2014-10-09',1412820240,1412854140,7),(337,7,'2014-10-09',1412820720,1412854020,3),(338,8,'2014-10-09',1412818500,1412854020,7),(339,9,'2014-10-09',1412820240,1412856840,7),(340,10,'2014-10-09',1412820240,1412857860,7),(341,11,'2014-10-09',0,0,6),(342,12,'2014-10-09',1412820960,0,5),(343,13,'2014-10-09',1412820240,1412856540,7),(344,14,'2014-10-09',1412819580,1412858040,7),(345,15,'2014-10-09',0,0,6),(346,16,'2014-10-09',1412819640,1412852460,7),(347,17,'2014-10-09',1412820240,1412858100,7),(348,18,'2014-10-09',0,0,6),(349,19,'2014-10-09',1412819520,1412860080,7),(350,20,'2014-10-09',1412818740,1412858460,7),(351,21,'2014-10-09',1412819880,1412859120,7),(352,22,'2014-10-09',1412817900,1412854380,7),(353,23,'2014-10-09',0,0,6),(354,24,'2014-10-09',1412820240,1412854440,7),(355,25,'2014-10-09',1412819460,1412852580,7),(356,26,'2014-10-09',1412819880,1412853180,7),(357,27,'2014-10-09',1412817060,1412853180,7),(358,28,'2014-10-09',0,0,6),(359,29,'2014-10-09',1412818440,1412860200,7),(360,30,'2014-10-09',1412820240,1412854020,7),(361,31,'2014-10-09',1412820960,1412856060,3),(362,32,'2014-10-09',1412814900,1412857200,7),(363,33,'2014-10-09',0,0,6),(364,34,'2014-10-09',1412820600,1412857200,7),(365,35,'2014-10-09',1412819880,1412852340,7),(366,36,'2014-10-09',0,0,6),(367,37,'2014-10-09',1412818440,1412858400,7),(368,38,'2014-10-09',1412819160,1412857380,7),(369,39,'2014-10-09',1412819880,1412853900,7),(371,4,'2014-10-10',1412906040,0,5),(372,5,'2014-10-10',1412906760,0,5),(373,6,'2014-10-10',1412906880,1412945100,7),(374,7,'2014-10-10',1412910420,1412943060,8),(375,8,'2014-10-10',1412906160,1412939400,7),(376,9,'2014-10-10',0,0,6),(377,10,'2014-10-10',1412906520,0,5),(378,11,'2014-10-10',1412906700,0,5),(379,12,'2014-10-10',1412906940,1412944200,7),(380,13,'2014-10-10',1412906400,1412941680,7),(381,14,'2014-10-10',1412906400,0,5),(382,15,'2014-10-10',0,0,6),(383,16,'2014-10-10',1412906160,1412938920,7),(384,17,'2014-10-10',1412906340,1412949660,7),(385,18,'2014-10-10',0,0,6),(386,19,'2014-10-10',1412905620,0,5),(387,20,'2014-10-10',1412904780,0,5),(388,21,'2014-10-10',1412906700,0,5),(389,22,'2014-10-10',1412903640,1412943780,7),(390,23,'2014-10-10',0,0,6),(391,24,'2014-10-10',1412906160,1412940300,7),(392,25,'2014-10-10',1412906340,1412938920,7),(393,26,'2014-10-10',1412905920,1412939760,7),(394,27,'2014-10-10',1412905860,1412939760,7),(395,28,'2014-10-10',0,0,6),(396,29,'2014-10-10',1412904900,1412946840,7),(397,30,'2014-10-10',1412906820,1412939400,7),(398,31,'2014-10-10',0,1412943060,2),(399,32,'2014-10-10',1412903340,1412944200,7),(400,33,'2014-10-10',0,0,6),(401,34,'2014-10-10',1412907300,0,5),(402,35,'2014-10-10',1412906820,1412938800,7),(403,36,'2014-10-10',0,0,6),(404,37,'2014-10-10',1412904780,0,5),(405,38,'2014-10-10',1412905860,0,5),(406,39,'2014-10-10',1412905620,1412940960,1),(408,4,'2014-10-11',0,0,6),(409,5,'2014-10-11',0,0,6),(410,6,'2014-10-11',1413003360,1413025560,8),(411,7,'2014-10-11',1412998020,1413027240,8),(412,8,'2014-10-11',1412992140,1413025680,7),(413,9,'2014-10-11',1412998380,1413027180,8),(414,10,'2014-10-11',1412995080,1413027180,3),(415,11,'2014-10-11',1412996160,1413027240,3),(416,12,'2014-10-11',1412995740,1413031860,3),(417,13,'2014-10-11',1412998620,1413027240,8),(418,14,'2014-10-11',1412992620,1413025800,7),(419,15,'2014-10-11',0,0,6),(420,16,'2014-10-11',1412997900,1413025440,8),(421,17,'2014-10-11',1412993040,1413027180,7),(422,18,'2014-10-11',0,0,6),(423,19,'2014-10-11',1412960940,1413027120,7),(424,20,'2014-10-11',1412960940,1413026760,7),(425,21,'2014-10-11',1412958000,1413027060,7),(426,22,'2014-10-11',1412990400,1413026700,7),(427,23,'2014-10-11',0,0,6),(428,24,'2014-10-11',0,0,6),(429,25,'2014-10-11',0,0,6),(430,26,'2014-10-11',1412992320,0,5),(431,27,'2014-10-11',1412991960,1413025800,7),(432,28,'2014-10-11',0,0,6),(433,29,'2014-10-11',0,0,6),(434,30,'2014-10-11',1412992440,1413025560,7),(435,31,'2014-10-11',0,0,1),(436,32,'2014-10-11',1412987940,1413027240,7),(437,33,'2014-10-11',0,0,6),(438,34,'2014-10-11',1412993640,1413027240,3),(439,35,'2014-10-11',0,0,6),(440,36,'2014-10-11',0,0,6),(441,37,'2014-10-11',1412958000,1413026580,7),(442,38,'2014-10-11',1412957760,1413026700,7),(443,39,'2014-10-11',0,0,1),(445,4,'2014-10-13',1413165960,1413199800,7),(446,5,'2014-10-13',1413165840,1413198240,1),(447,6,'2014-10-13',1413165840,1413198240,7),(448,7,'2014-10-13',1413165960,1413199800,7),(449,8,'2014-10-13',1413163980,1413199560,7),(450,9,'2014-10-13',0,1413200100,2),(451,10,'2014-10-13',1413165960,1413208260,7),(452,11,'2014-10-13',1413166200,1413208140,7),(453,12,'2014-10-13',1413166500,1413205920,3),(454,13,'2014-10-13',1413166800,1413200100,3),(455,14,'2014-10-13',1413165900,1413203520,7),(456,15,'2014-10-13',0,0,6),(457,16,'2014-10-13',1413166320,1413198180,3),(458,17,'2014-10-13',1413164880,1413198360,7),(459,18,'2014-10-13',0,0,6),(460,19,'2014-10-13',1413164640,0,5),(461,20,'2014-10-13',1413164280,1413206820,7),(462,21,'2014-10-13',1413165720,1413209880,7),(463,22,'2014-10-13',1413163980,1413199620,7),(464,23,'2014-10-13',0,0,6),(465,24,'2014-10-13',1413164700,1413203640,7),(466,25,'2014-10-13',1413164880,1413198060,7),(467,26,'2014-10-13',1413165480,1413199260,7),(468,27,'2014-10-13',1413164880,1413199200,7),(469,28,'2014-10-13',0,0,6),(470,29,'2014-10-13',1413164100,1413198060,7),(471,30,'2014-10-13',1413165660,1413198240,7),(472,31,'2014-10-13',0,1413199800,2),(473,32,'2014-10-13',1413163980,1413206460,7),(474,33,'2014-10-13',0,0,6),(475,34,'2014-10-13',1413166320,1413206460,3),(476,35,'2014-10-13',1413165780,0,5),(477,36,'2014-10-13',0,0,6),(478,37,'2014-10-13',1413164880,1413205380,7),(479,38,'2014-10-13',1413165600,1413200340,7),(480,39,'2014-10-13',1413164880,1413199440,7),(482,4,'2014-10-14',1413253140,1413289380,3),(483,5,'2014-10-14',1413252000,1413284880,7),(484,6,'2014-10-14',1413252120,1413289680,7),(485,7,'2014-10-14',1413255120,1413288060,3),(486,8,'2014-10-14',1413250140,1413284820,7),(487,9,'2014-10-14',0,1413285420,2),(488,10,'2014-10-14',1413255120,1413289800,3),(489,11,'2014-10-14',1413253020,1413290580,3),(490,12,'2014-10-14',1413253200,1413289680,3),(491,13,'2014-10-14',1413251460,1413285540,7),(492,14,'2014-10-14',1413251640,1413284520,7),(493,15,'2014-10-14',0,0,6),(494,16,'2014-10-14',1413252240,1413284460,7),(495,17,'2014-10-14',1413252060,1413284580,7),(496,18,'2014-10-14',0,0,6),(497,19,'2014-10-14',1413252780,1413296280,3),(498,20,'2014-10-14',0,0,6),(499,21,'2014-10-14',1413252000,1413294540,7),(500,22,'2014-10-14',1413250980,1413287340,7),(501,23,'2014-10-14',0,0,6),(502,24,'2014-10-14',1413251400,1413287340,7),(503,25,'2014-10-14',1413251820,1413284760,7),(504,26,'2014-10-14',1413251880,1413285480,7),(505,27,'2014-10-14',1413251040,1413285540,7),(506,28,'2014-10-14',0,0,6),(507,29,'2014-10-14',1413250920,1413293820,7),(508,30,'2014-10-14',1413252060,1413284880,7),(509,31,'2014-10-14',1413252420,1413287400,7),(510,32,'2014-10-14',1413247080,1413289740,7),(511,33,'2014-10-14',0,0,6),(512,34,'2014-10-14',1413252480,1413289740,7),(513,35,'2014-10-14',1413252420,1413252900,4),(514,36,'2014-10-14',0,0,6),(515,37,'2014-10-14',1413250260,1413289080,7),(516,38,'2014-10-14',1413251640,1413286980,7),(517,39,'2014-10-14',1413251460,1413285660,7),(519,4,'2014-10-15',1413338760,1413373440,7),(520,5,'2014-10-15',1413337740,1413371100,7),(521,6,'2014-10-15',1413340140,1413371100,3),(522,7,'2014-10-15',1413338760,1413371460,7),(523,8,'2014-10-15',1413336600,1413373560,7),(524,9,'2014-10-15',1413337680,1413371640,7),(525,10,'2014-10-15',1413338820,1413373680,7),(526,11,'2014-10-15',1413338820,1413373860,7),(527,12,'2014-10-15',1413339120,1413373920,3),(528,13,'2014-10-15',1413339420,1413371160,3),(529,14,'2014-10-15',1413338820,1413373200,7),(530,15,'2014-10-15',0,0,6),(531,16,'2014-10-15',1413337800,1413370920,7),(532,17,'2014-10-15',1413338760,1413373200,7),(533,18,'2014-10-15',0,0,6),(534,19,'2014-10-15',1413339360,1413373920,3),(535,20,'2014-10-15',1413336780,1413373920,7),(536,21,'2014-10-15',1413338460,1413373740,7),(537,22,'2014-10-15',1413336420,1413371820,7),(538,23,'2014-10-15',0,0,6),(539,24,'2014-10-15',1413337680,1413371760,7),(540,25,'2014-10-15',1413337920,1413370980,7),(541,26,'2014-10-15',1413337980,1413371820,7),(542,27,'2014-10-15',1413337140,1413371820,7),(543,28,'2014-10-15',0,0,6),(544,29,'2014-10-15',1413336480,1413370920,7),(545,30,'2014-10-15',1413338340,1413371220,7),(546,31,'2014-10-15',1413341580,1413373560,3),(547,32,'2014-10-15',1413333360,0,5),(548,33,'2014-10-15',0,0,6),(549,34,'2014-10-15',1413339000,1413371580,7),(550,35,'2014-10-15',1413337740,1413370920,7),(551,36,'2014-10-15',0,0,6),(552,37,'2014-10-15',1413337020,1413373920,7),(553,38,'2014-10-15',1413337980,1413372600,7),(554,39,'2014-10-15',1413336960,1413371820,7),(556,4,'2014-10-16',1413423180,0,5),(557,5,'2014-10-16',1413424920,1413457560,7),(558,6,'2014-10-16',1413425040,1413457500,7),(559,7,'2014-10-16',1413427020,0,5),(560,8,'2014-10-16',1413422520,1413458100,7),(561,9,'2014-10-16',1413424380,1413458280,7),(562,10,'2014-10-16',1413425640,1413458700,3),(563,11,'2014-10-16',1413425280,1413458940,7),(564,12,'2014-10-16',1413425280,1413458520,7),(565,13,'2014-10-16',1413424380,1413458340,7),(566,14,'2014-10-16',1413424440,1413458520,7),(567,15,'2014-10-16',0,0,6),(568,16,'2014-10-16',1413424380,1413457320,7),(569,17,'2014-10-16',1413424860,1413457980,7),(570,18,'2014-10-16',0,0,6),(571,19,'2014-10-16',1413425400,1413455040,4),(572,20,'2014-10-16',1413423600,1413460920,7),(573,21,'2014-10-16',1413424500,1413460080,7),(574,22,'2014-10-16',1413423240,1413459960,7),(575,23,'2014-10-16',0,0,6),(576,24,'2014-10-16',1413425040,1413457680,7),(577,25,'2014-10-16',1413424380,1413458220,7),(578,26,'2014-10-16',1413424500,1413458400,7),(579,27,'2014-10-16',1413423720,1413458760,7),(580,28,'2014-10-16',0,0,6),(581,29,'2014-10-16',1413423540,1413459780,7),(582,30,'2014-10-16',1413425040,0,5),(583,31,'2014-10-16',1413427140,1413458700,3),(584,32,'2014-10-16',1413420360,0,5),(585,33,'2014-10-16',0,0,6),(586,34,'2014-10-16',1413425340,1413459120,7),(587,35,'2014-10-16',1413424740,0,5),(588,36,'2014-10-16',0,0,6),(589,37,'2014-10-16',1413423120,1413460920,7),(590,38,'2014-10-16',1413424860,1413458940,7),(591,39,'2014-10-16',1413424500,1413459060,7),(593,4,'2014-10-17',1413511260,0,5),(594,5,'2014-10-17',1413510540,1413543960,7),(595,6,'2014-10-17',1413511560,1413543960,7),(596,7,'2014-10-17',1413511860,1413544020,3),(597,8,'2014-10-17',1413509280,1413544020,7),(598,9,'2014-10-17',1413510660,1413545160,7),(599,10,'2014-10-17',1413511380,1413546840,7),(600,11,'2014-10-17',1413511800,1413547020,7),(601,12,'2014-10-17',1413512400,1413544920,3),(602,13,'2014-10-17',1413510660,1413545280,7),(603,14,'2014-10-17',1413511080,1413545880,7),(604,15,'2014-10-17',0,0,6),(605,16,'2014-10-17',1413510720,1413543960,7),(606,17,'2014-10-17',1413511380,1413545760,7),(607,18,'2014-10-17',0,0,6),(608,19,'2014-10-17',1413510300,1413548820,7),(609,20,'2014-10-17',1413509700,1413546060,7),(610,21,'2014-10-17',1413511680,1413548400,7),(611,22,'2014-10-17',1413509700,1413544860,7),(612,23,'2014-10-17',0,0,6),(613,24,'2014-10-17',1413511080,1413544740,7),(614,25,'2014-10-17',1413511080,1413544020,7),(615,26,'2014-10-17',1413511080,1413545040,7),(616,27,'2014-10-17',1413510300,1413545040,7),(617,28,'2014-10-17',0,0,6),(618,29,'2014-10-17',1413509640,1413548880,7),(619,30,'2014-10-17',1413511260,1413544080,7),(620,31,'2014-10-17',1413515640,0,5),(621,32,'2014-10-17',1413506580,1413544860,7),(622,33,'2014-10-17',0,0,6),(623,34,'2014-10-17',1413511800,1413544980,7),(624,35,'2014-10-17',1413511080,0,5),(625,36,'2014-10-17',0,0,6),(626,37,'2014-10-17',1413509760,1413548400,7),(627,38,'2014-10-17',1413510600,1413545880,7),(628,39,'2014-10-17',1413510540,1413545280,7),(630,4,'2014-10-18',0,1413625140,2),(631,5,'2014-10-18',1413605100,1413617400,10),(632,6,'2014-10-18',1413604560,1413630060,8),(633,7,'2014-10-18',1413597960,1413629640,7),(634,8,'2014-10-18',1413597240,1413630240,7),(635,9,'2014-10-18',1413603540,1413630240,8),(636,10,'2014-10-18',1413597720,1413630120,7),(637,11,'2014-10-18',1413599100,1413630240,3),(638,12,'2014-10-18',1413604500,1413633120,8),(639,13,'2014-10-18',1413603480,1413630240,8),(640,14,'2014-10-18',1413598080,1413630000,7),(641,15,'2014-10-18',0,0,6),(642,16,'2014-10-18',1413600000,1413630060,3),(643,17,'2014-10-18',1413597720,1413630180,7),(644,18,'2014-10-18',0,0,6),(645,19,'2014-10-18',1413598020,1413631800,7),(646,20,'2014-10-18',0,1413632340,2),(647,21,'2014-10-18',1413597120,1413631020,7),(648,22,'2014-10-18',1413597060,1413631260,7),(649,23,'2014-10-18',0,0,6),(650,24,'2014-10-18',1413597660,1413630780,7),(651,25,'2014-10-18',1413597060,1413630120,7),(652,26,'2014-10-18',1413597300,1413630180,7),(653,27,'2014-10-18',1413597060,1413630180,7),(654,28,'2014-10-18',0,0,6),(655,29,'2014-10-18',1413597060,1413627480,4),(656,30,'2014-10-18',1413597600,1413630360,7),(657,31,'2014-10-18',1413601260,1413630000,8),(658,32,'2014-10-18',1413597120,1413632940,7),(659,33,'2014-10-18',0,0,6),(660,34,'2014-10-18',0,0,1),(661,35,'2014-10-18',0,0,6),(662,36,'2014-10-18',0,0,6),(663,37,'2014-10-18',1413597120,1413631800,7),(664,38,'2014-10-18',1413597720,1413630180,7),(665,39,'2014-10-18',1413597120,1413630480,7),(667,4,'2014-10-20',1413770280,1413804660,7),(668,5,'2014-10-20',1413770280,1413803280,7),(669,6,'2014-10-20',1413770640,1413803640,7),(670,7,'2014-10-20',1413770640,1413804300,7),(671,8,'2014-10-20',1413767580,1413803160,7),(672,9,'2014-10-20',1413770460,1413805020,7),(673,10,'2014-10-20',1413771000,1413805020,7),(674,11,'2014-10-20',1413770760,1413805380,7),(675,12,'2014-10-20',1413771240,1413808260,3),(676,13,'2014-10-20',1413770460,1413805020,7),(677,14,'2014-10-20',1413770220,1413807540,7),(678,15,'2014-10-20',0,0,6),(679,16,'2014-10-20',1413769680,1413802920,7),(680,17,'2014-10-20',1413769800,1413804540,7),(681,18,'2014-10-20',0,0,6),(682,19,'2014-10-20',1413770700,1413807540,7),(683,20,'2014-10-20',1413768900,1413807480,7),(684,21,'2014-10-20',1413770280,1413807240,7),(685,22,'2014-10-20',1413768360,1413806460,7),(686,23,'2014-10-20',0,0,6),(687,24,'2014-10-20',1413769200,1413803760,7),(688,25,'2014-10-20',1413770040,1413802980,7),(689,26,'2014-10-20',1413770040,1413803160,7),(690,27,'2014-10-20',1413769440,1413803100,7),(691,28,'2014-10-20',0,0,6),(692,29,'2014-10-20',1413770460,1413802920,7),(693,30,'2014-10-20',1413770640,1413803580,7),(694,31,'2014-10-20',1413770340,1413802800,7),(695,32,'2014-10-20',1413765840,1413808260,6),(696,33,'2014-10-20',0,0,6),(697,34,'2014-10-20',1413770820,1413808260,7),(698,35,'2014-10-20',1413769980,1413802800,7),(699,36,'2014-10-20',0,0,6),(700,37,'2014-10-20',1413769920,1413806460,7),(701,38,'2014-10-20',1413770220,1413804900,7),(702,39,'2014-10-20',1413769560,1413803160,7),(704,4,'2014-10-21',1413856740,1413891720,7),(705,5,'2014-10-21',1413856800,1413890520,1),(706,6,'2014-10-21',1413857220,1413890520,7),(707,7,'2014-10-21',1413857160,1413891720,7),(708,8,'2014-10-21',1413854760,1413890940,7),(709,9,'2014-10-21',1413856320,1413891660,7),(710,10,'2014-10-21',1413857280,1413894600,7),(711,11,'2014-10-21',1413857880,1413894600,3),(712,12,'2014-10-21',1413857400,1413891660,7),(713,13,'2014-10-21',1413856320,1413891060,7),(714,14,'2014-10-21',1413857280,1413892560,7),(715,15,'2014-10-21',0,0,6),(716,16,'2014-10-21',1413855780,1413889320,7),(717,17,'2014-10-21',1413858240,1413892560,3),(718,18,'2014-10-21',0,0,6),(719,19,'2014-10-21',1413857280,1413894360,7),(720,20,'2014-10-21',1413855060,1413894420,7),(721,21,'2014-10-21',1413856800,1413890460,7),(722,22,'2014-10-21',1413854880,1413894540,7),(723,23,'2014-10-21',0,0,6),(724,24,'2014-10-21',1413856500,1413890460,7),(725,25,'2014-10-21',1413856440,1413889320,7),(726,26,'2014-10-21',1413856560,1413889980,7),(727,27,'2014-10-21',1413855240,1413891720,7),(728,28,'2014-10-21',0,0,6),(729,29,'2014-10-21',1413855060,1413889260,7),(730,30,'2014-10-21',1413857400,1413891660,7),(731,31,'2014-10-21',1413858780,1413891240,3),(732,32,'2014-10-21',1413852000,1413890940,7),(733,33,'2014-10-21',0,0,6),(734,34,'2014-10-21',1413857280,1413890520,7),(735,35,'2014-10-21',1413857460,1413889200,3),(736,36,'2014-10-21',0,0,6),(737,37,'2014-10-21',1413855240,1413894540,7),(738,38,'2014-10-21',1413856980,1413894600,7),(739,39,'2014-10-21',1413856200,1413890520,7),(741,4,'2014-10-22',1413948600,1413980400,8),(742,5,'2014-10-22',1413943380,1413975900,7),(743,6,'2014-10-22',1413943080,1413983460,7),(744,7,'2014-10-22',1413943800,1413976860,7),(745,8,'2014-10-22',1413942060,1413976020,7),(746,9,'2014-10-22',1413943560,0,5),(747,10,'2014-10-22',1413943500,1413992820,7),(748,11,'2014-10-22',1413944040,1413992820,3),(749,12,'2014-10-22',1413944400,1413978060,3),(750,13,'2014-10-22',1413943560,1413976080,7),(751,14,'2014-10-22',1413942900,1413976620,7),(752,15,'2014-10-22',0,0,6),(753,16,'2014-10-22',1413942000,1413975780,7),(754,17,'2014-10-22',1413942360,1413979380,7),(755,18,'2014-10-22',0,0,6),(756,19,'2014-10-22',1413943200,1413981840,7),(757,20,'2014-10-22',1413941820,1413981840,7),(758,21,'2014-10-22',1413943140,1413979800,7),(759,22,'2014-10-22',1413941580,1413980820,7),(760,23,'2014-10-22',0,0,6),(761,24,'2014-10-22',1413942000,1413978360,7),(762,25,'2014-10-22',1413943260,1413976500,7),(763,26,'2014-10-22',1413943020,1413977820,7),(764,27,'2014-10-22',1413942360,1413977820,7),(765,28,'2014-10-22',0,0,6),(766,29,'2014-10-22',1413941580,1413979380,7),(767,30,'2014-10-22',1413942900,1413976080,7),(768,31,'2014-10-22',1413945000,1413974280,3),(769,32,'2014-10-22',1413938280,1413976080,7),(770,33,'2014-10-22',0,0,6),(771,34,'2014-10-22',1413943500,1413976140,7),(772,35,'2014-10-22',1413943260,1413975480,7),(773,36,'2014-10-22',0,0,6),(774,37,'2014-10-22',1413942360,1413980820,7),(775,38,'2014-10-22',1413943020,1413977520,7),(776,39,'2014-10-22',1413942840,1413977280,7),(778,4,'2014-10-23',1414029960,1414070820,7),(779,5,'2014-10-23',1414029600,1414067580,7),(780,6,'2014-10-23',1414029540,1414073760,7),(781,7,'2014-10-23',1414029780,1414064640,7),(782,8,'2014-10-23',1414027620,1414062360,7),(783,9,'2014-10-23',1414028820,1414064340,7),(784,10,'2014-10-23',1414032540,1414079880,3),(785,11,'2014-10-23',1414030440,1414079820,3),(786,12,'2014-10-23',1414029720,1414068000,7),(787,13,'2014-10-23',1414028820,1414063080,7),(788,14,'2014-10-23',1414029480,1414066560,7),(789,15,'2014-10-23',0,0,6),(790,16,'2014-10-23',1414029480,1414063200,7),(791,17,'2014-10-23',1414028940,1414066260,7),(792,18,'2014-10-23',0,0,6),(793,19,'2014-10-23',1414029120,1414067580,7),(794,20,'2014-10-23',1414027620,1414065780,7),(795,21,'2014-10-23',1414029360,1414067340,7),(796,22,'2014-10-23',1414026540,1414066500,7),(797,23,'2014-10-23',0,0,6),(798,24,'2014-10-23',1414029120,1414064220,7),(799,25,'2014-10-23',0,0,6),(800,26,'2014-10-23',1414029360,1414064580,7),(801,27,'2014-10-23',1414028760,1414064580,7),(802,28,'2014-10-23',0,0,6),(803,29,'2014-10-23',0,0,6),(804,30,'2014-10-23',1414029420,1414065300,7),(805,31,'2014-10-23',1414032180,1414064700,3),(806,32,'2014-10-23',1414024680,1414068000,7),(807,33,'2014-10-23',0,0,6),(808,34,'2014-10-23',1414030080,1414065420,7),(809,35,'2014-10-23',1414029660,1414061940,7),(810,36,'2014-10-23',0,0,6),(811,37,'2014-10-23',1414028460,1414066500,7),(812,38,'2014-10-23',1414028940,1414069020,7),(813,39,'2014-10-23',1414028940,1414064040,7),(815,4,'2014-10-24',1414116420,1414156320,7),(816,5,'2014-10-24',1414116420,1414157100,7),(817,6,'2014-10-24',1414117140,1414157100,3),(818,7,'2014-10-24',1414117560,1414149960,3),(819,8,'2014-10-24',1414114800,1414148820,7),(820,9,'2014-10-24',1414115580,1414151520,7),(821,10,'2014-10-24',1414121400,1414152300,8),(822,11,'2014-10-24',1414118160,1414151220,3),(823,12,'2014-10-24',1414116240,1414158540,7),(824,13,'2014-10-24',1414115580,1414151400,7),(825,14,'2014-10-24',1414116180,1414152240,7),(826,15,'2014-10-24',0,0,6),(827,16,'2014-10-24',0,1414148820,2),(828,17,'2014-10-24',1414115940,1414152300,7),(829,18,'2014-10-24',0,0,6),(830,19,'2014-10-24',1414116060,1414156380,7),(831,20,'2014-10-24',1414114020,1414151880,7),(832,21,'2014-10-24',1414116060,1414152300,7),(833,22,'2014-10-24',1414114260,1414154220,7),(834,23,'2014-10-24',0,0,6),(835,24,'2014-10-24',1414114860,1414148880,7),(836,25,'2014-10-24',1414115940,1414148700,7),(837,26,'2014-10-24',1414114980,1414151340,7),(838,27,'2014-10-24',1414115280,1414151340,7),(839,28,'2014-10-24',0,0,6),(840,29,'2014-10-24',1414114980,1414151040,7),(841,30,'2014-10-24',1414115580,1414149180,7),(842,31,'2014-10-24',1414117320,1414156260,3),(843,32,'2014-10-24',1414111080,1414158600,7),(844,33,'2014-10-24',0,0,6),(845,34,'2014-10-24',1414115580,1414158600,7),(846,35,'2014-10-24',1414116180,0,5),(847,36,'2014-10-24',0,0,6),(848,37,'2014-10-24',1414114380,1414154220,7),(849,38,'2014-10-24',1414115700,0,5),(850,39,'2014-10-24',1414115160,1414151280,7),(852,4,'2014-10-25',1414212240,1414225440,10),(853,5,'2014-10-25',1414208520,1414223760,10),(854,6,'2014-10-25',1414212180,1414235160,8),(855,7,'2014-10-25',1414203660,1414235160,3),(856,8,'2014-10-25',1414203360,1414234980,3),(857,9,'2014-10-25',1414207980,1414235700,8),(858,10,'2014-10-25',1414205700,1414235640,3),(859,11,'2014-10-25',1414203420,1414235760,3),(860,12,'2014-10-25',1414204380,1414233120,3),(861,13,'2014-10-25',1414207980,1414235760,8),(862,14,'2014-10-25',1414203360,1414235100,3),(863,15,'2014-10-25',0,0,6),(864,16,'2014-10-25',1414206780,1414220940,10),(865,17,'2014-10-25',1414203300,1414234980,3),(866,18,'2014-10-25',0,0,6),(867,19,'2014-10-25',1414203480,0,5),(868,20,'2014-10-25',1414203360,1414234680,3),(869,21,'2014-10-25',1414203360,1414234980,3),(870,22,'2014-10-25',1414203300,1414234860,3),(871,23,'2014-10-25',0,0,6),(872,24,'2014-10-25',1414203300,1414234860,3),(873,25,'2014-10-25',1414204980,1414234980,3),(874,26,'2014-10-25',1414203420,1414234860,3),(875,27,'2014-10-25',1414203300,1414234860,3),(876,28,'2014-10-25',0,0,6),(877,29,'2014-10-25',1414203360,1414235580,3),(878,30,'2014-10-25',1414203360,1414235160,3),(879,31,'2014-10-25',1414203360,0,5),(880,32,'2014-10-25',0,0,6),(881,33,'2014-10-25',0,0,6),(882,34,'2014-10-25',1414203420,1414232400,9),(883,35,'2014-10-25',1414204860,1414222860,9),(884,36,'2014-10-25',0,0,6),(885,37,'2014-10-25',1414203300,1414234920,3),(886,38,'2014-10-25',1414203600,1414235100,3),(887,39,'2014-10-25',1414203300,1414234920,3),(889,4,'2014-10-27',1414376100,1414411860,3),(890,5,'2014-10-27',1414375260,1414408260,7),(891,6,'2014-10-27',1414376520,1414408260,3),(892,7,'2014-10-27',1414375500,1414408800,7),(893,8,'2014-10-27',0,0,6),(894,9,'2014-10-27',0,0,6),(895,10,'2014-10-27',1414375860,1414408260,3),(896,11,'2014-10-27',1414375620,1414409400,7),(897,12,'2014-10-27',1414377600,1414407960,3),(898,13,'2014-10-27',1414376100,1414408320,3),(899,14,'2014-10-27',1414375860,1414407900,3),(900,15,'2014-10-27',0,0,6),(901,16,'2014-10-27',1414374120,1414407780,7),(902,17,'2014-10-27',1414375200,1414407900,7),(903,18,'2014-10-27',0,0,6),(904,19,'2014-10-27',1414372200,1414411440,7),(905,20,'2014-10-27',1414374060,1414408260,7),(906,21,'2014-10-27',1414375500,1414411500,7),(907,22,'2014-10-27',1414373700,1414410720,7),(908,23,'2014-10-27',0,0,6),(909,24,'2014-10-27',1414374240,1414407960,7),(910,25,'2014-10-27',1414374420,1414407780,7),(911,26,'2014-10-27',1414375140,1414407900,7),(912,27,'2014-10-27',1414374060,1414408020,7),(913,28,'2014-10-27',0,0,6),(914,29,'2014-10-27',1414375380,1414407840,7),(915,30,'2014-10-27',1414375740,1414408560,7),(916,31,'2014-10-27',1414375620,1414414800,7),(917,32,'2014-10-27',1414370520,1414414800,7),(918,33,'2014-10-27',0,0,6),(919,34,'2014-10-27',1414375980,1414411440,3),(920,35,'2014-10-27',0,0,6),(921,36,'2014-10-27',0,0,6),(922,37,'2014-10-27',1414375080,1414410720,7),(923,38,'2014-10-27',1414375260,1414408080,7),(924,39,'2014-10-27',1414374660,1414408140,7),(926,4,'2014-10-28',1414462500,1414496400,3),(927,5,'2014-10-28',1414461180,1414494840,1),(928,6,'2014-10-28',1414461480,1414497480,7),(929,7,'2014-10-28',1414461840,1414496580,7),(930,8,'2014-10-28',0,0,6),(931,9,'2014-10-28',1414461600,1414495500,7),(932,10,'2014-10-28',1414461840,1414494720,7),(933,11,'2014-10-28',1414461840,1414494780,7),(934,12,'2014-10-28',1414470300,1414500660,8),(935,13,'2014-10-28',1414461600,1414495500,7),(936,14,'2014-10-28',1414460880,1414494180,7),(937,15,'2014-10-28',0,0,6),(938,16,'2014-10-28',1414460760,1414494240,7),(939,17,'2014-10-28',1414461840,1414495440,7),(940,18,'2014-10-28',0,0,6),(941,19,'2014-10-28',1414462200,1414499400,7),(942,20,'2014-10-28',0,0,6),(943,21,'2014-10-28',1414461420,1414497720,7),(944,22,'2014-10-28',1414465020,1414499400,3),(945,23,'2014-10-28',0,0,6),(946,24,'2014-10-28',1414460460,1414498080,7),(947,25,'2014-10-28',1414461600,1414494300,7),(948,26,'2014-10-28',1414461180,1414494600,7),(949,27,'2014-10-28',1414460700,1414497120,7),(950,28,'2014-10-28',0,0,6),(951,29,'2014-10-28',1414460880,1414497720,7),(952,30,'2014-10-28',1414461000,1414495020,7),(953,31,'2014-10-28',1414463100,1414498200,3),(954,32,'2014-10-28',1414457400,1414500360,7),(955,33,'2014-10-28',0,0,6),(956,34,'2014-10-28',1414462020,1414499460,7),(957,35,'2014-10-28',0,0,6),(958,36,'2014-10-28',0,0,6),(959,37,'2014-10-28',1414460040,1414499400,7),(960,38,'2014-10-28',1414461480,1414500660,7),(961,39,'2014-10-28',1414461180,1414497000,7),(963,4,'2014-10-29',1414547760,1414580820,7),(964,5,'2014-10-29',1414548240,1414580400,7),(965,6,'2014-10-29',1414548240,1414580400,7),(966,7,'2014-10-29',1414548360,1414580580,7),(967,8,'2014-10-29',1414546740,1414580580,7),(968,9,'2014-10-29',1414548120,1414581600,7),(969,10,'2014-10-29',1414548660,1414585080,3),(970,11,'2014-10-29',1414548840,1414585080,3),(971,12,'2014-10-29',1414549800,1414582140,3),(972,13,'2014-10-29',1414548120,1414581600,7),(973,14,'2014-10-29',1414548540,1414584840,7),(974,15,'2014-10-29',0,0,6),(975,16,'2014-10-29',1414547940,1414580640,7),(976,17,'2014-10-29',1414548120,1414584780,7),(977,18,'2014-10-29',0,0,6),(978,19,'2014-10-29',1414548300,1414586820,7),(979,20,'2014-10-29',1414545960,1414583160,7),(980,21,'2014-10-29',1414547340,1414583340,7),(981,22,'2014-10-29',1414545840,1414586820,7),(982,23,'2014-10-29',0,0,6),(983,24,'2014-10-29',1414548300,1414583340,7),(984,25,'2014-10-29',1414547700,1414580520,7),(985,26,'2014-10-29',1414547640,1414583700,7),(986,27,'2014-10-29',1414547340,1414583280,7),(987,28,'2014-10-29',0,0,6),(988,29,'2014-10-29',1414546260,1414580460,7),(989,30,'2014-10-29',1414547940,1414580820,7),(990,31,'2014-10-29',1414548480,1414580880,7),(991,32,'2014-10-29',1414543320,1414585140,7),(992,33,'2014-10-29',0,0,6),(993,34,'2014-10-29',1414548540,1414580880,7),(994,35,'2014-10-29',0,0,6),(995,36,'2014-10-29',0,0,6),(996,37,'2014-10-29',1414546920,1414584180,7),(997,38,'2014-10-29',1414547820,1414584120,7),(998,39,'2014-10-29',1414547340,1414585140,7),(1000,4,'2014-10-30',1414634580,1414669500,7),(1001,5,'2014-10-30',1414634280,1414667280,7),(1002,6,'2014-10-30',1414635600,1414667280,3),(1003,7,'2014-10-30',1414634940,1414667880,7),(1004,8,'2014-10-30',1414634100,1414667280,7),(1005,9,'2014-10-30',1414637700,1414668840,3),(1006,10,'2014-10-30',1414634520,1414668960,7),(1007,11,'2014-10-30',1414634880,1414668960,7),(1008,12,'2014-10-30',1414635300,1414669500,3),(1009,13,'2014-10-30',1414634880,1414668420,7),(1010,14,'2014-10-30',1414634940,1414667640,7),(1011,15,'2014-10-30',0,0,6),(1012,16,'2014-10-30',0,1414666980,2),(1013,17,'2014-10-30',1414634220,1414668960,7),(1014,18,'2014-10-30',0,0,6),(1015,19,'2014-10-30',1414630560,1414676580,7),(1016,20,'2014-10-30',1414631640,1414671120,7),(1017,21,'2014-10-30',1414634280,1414670280,7),(1018,22,'2014-10-30',1414632960,1414671480,7),(1019,23,'2014-10-30',0,0,6),(1020,24,'2014-10-30',1414634280,1414670280,7),(1021,25,'2014-10-30',1414634400,1414667100,7),(1022,26,'2014-10-30',1414633560,1414669440,7),(1023,27,'2014-10-30',1414633680,1414669440,7),(1024,28,'2014-10-30',0,0,6),(1025,29,'2014-10-30',1414634880,1414676580,7),(1026,30,'2014-10-30',1414635000,1414667280,7),(1027,31,'2014-10-30',1414635000,1414674660,7),(1028,32,'2014-10-30',0,1414674600,2),(1029,33,'2014-10-30',0,0,6),(1030,34,'2014-10-30',1414635000,1414667220,7),(1031,35,'2014-10-30',0,0,6),(1032,36,'2014-10-30',0,0,6),(1033,37,'2014-10-30',1414634940,1414671420,7),(1034,38,'2014-10-30',1414634460,1414668960,7),(1035,39,'2014-10-30',1414633500,0,5),(1037,4,'2014-10-31',0,0,6),(1038,5,'2014-10-31',1414720680,1414753620,7),(1039,6,'2014-10-31',1414720680,1414753620,7),(1040,7,'2014-10-31',1414722600,1414754340,3),(1041,8,'2014-10-31',1414718520,1414754040,7),(1042,9,'2014-10-31',1414720560,1414753440,7),(1043,10,'2014-10-31',1414721460,1414753740,3),(1044,11,'2014-10-31',0,0,6),(1045,12,'2014-10-31',1414720680,1414754100,7),(1046,13,'2014-10-31',1414720560,1414753800,7),(1047,14,'2014-10-31',1414721340,1414753440,7),(1048,15,'2014-10-31',0,0,6),(1049,16,'2014-10-31',1414720500,1414753380,7),(1050,17,'2014-10-31',1414720920,1414753500,7),(1051,18,'2014-10-31',0,0,6),(1052,19,'2014-10-31',1414721400,1414758300,7),(1053,20,'2014-10-31',1414718760,1414756800,7),(1054,21,'2014-10-31',1414720740,1414756440,7),(1055,22,'2014-10-31',1414718820,1414756200,7),(1056,23,'2014-10-31',0,0,6),(1057,24,'2014-10-31',1414720500,1414754880,7),(1058,25,'2014-10-31',1414721160,1414753620,7),(1059,26,'2014-10-31',1414720320,1414753800,7),(1060,27,'2014-10-31',1414720140,1414756140,7),(1061,28,'2014-10-31',0,0,6),(1062,29,'2014-10-31',1414718580,1414753440,7),(1063,30,'2014-10-31',1414720860,1414753620,7),(1064,31,'2014-10-31',1414721460,1414753440,3),(1065,32,'2014-10-31',1414716120,1414755180,7),(1066,33,'2014-10-31',0,0,6),(1067,34,'2014-10-31',1414721340,1414754040,7),(1068,35,'2014-10-31',0,0,6),(1069,36,'2014-10-31',0,0,6),(1070,37,'2014-10-31',1414719180,1414756140,7),(1071,38,'2014-10-31',1414720920,1414753800,7),(1072,39,'2014-10-31',1414720020,1414756200,7),(1074,4,'2014-11-01',1414817940,1414832340,10),(1075,5,'2014-11-01',1414810980,1414827300,10),(1076,6,'2014-11-01',1414808640,1414841700,3),(1077,7,'2014-11-01',1414808520,1414841820,3),(1078,8,'2014-11-01',1414805760,1414839600,7),(1079,9,'2014-11-01',0,0,6),(1080,10,'2014-11-01',1414815000,1414839720,8),(1081,11,'2014-11-01',1414813680,1414841580,8),(1082,12,'2014-11-01',1414808040,0,5),(1083,13,'2014-11-01',0,0,6),(1084,14,'2014-11-01',1414814100,0,5),(1085,15,'2014-11-01',0,0,6),(1086,16,'2014-11-01',1414812240,1414839420,8),(1087,17,'2014-11-01',1414806660,1414840680,7),(1088,18,'2014-11-01',0,0,6),(1089,19,'2014-11-01',1414809840,1414839180,3),(1090,20,'2014-11-01',1414807200,1414839240,7),(1091,21,'2014-11-01',1414807920,1414837680,9),(1092,22,'2014-11-01',1414806420,1414840080,7),(1093,23,'2014-11-01',0,0,6),(1094,24,'2014-11-01',0,0,6),(1095,25,'2014-11-01',1414812360,0,5),(1096,26,'2014-11-01',1414807440,1414833840,4),(1097,27,'2014-11-01',1414806540,1414839420,7),(1098,28,'2014-11-01',0,0,6),(1099,29,'2014-11-01',1414805820,1414839420,7),(1100,30,'2014-11-01',1414807260,1414841760,7),(1101,31,'2014-11-01',1414807320,1414841820,7),(1102,32,'2014-11-01',0,1414839600,6),(1103,33,'2014-11-01',0,0,6),(1104,34,'2014-11-01',0,0,6),(1105,35,'2014-11-01',0,0,6),(1106,36,'2014-11-01',0,0,6),(1107,37,'2014-11-01',1414805640,1414840080,7),(1108,38,'2014-11-01',1414808040,1414839840,3),(1109,39,'2014-11-01',1414806480,1414840080,7),(1111,4,'2014-11-03',1414980540,1415017920,7),(1112,5,'2014-11-03',1414980240,1415012520,7),(1113,6,'2014-11-03',1414980120,1415012520,7),(1114,7,'2014-11-03',1414981920,1415013480,3),(1115,8,'2014-11-03',1414979460,1415012520,7),(1116,9,'2014-11-03',1414980540,1415014440,7),(1117,10,'2014-11-03',1414980420,1415014320,7),(1118,11,'2014-11-03',1414979880,1415014260,7),(1119,12,'2014-11-03',1414980540,1415027280,7),(1120,13,'2014-11-03',1414980540,1415014440,7),(1121,14,'2014-11-03',1414979820,1415014380,7),(1122,15,'2014-11-03',0,0,6),(1123,16,'2014-11-03',1414980060,1415012400,7),(1124,17,'2014-11-03',1414979280,1415014560,7),(1125,18,'2014-11-03',0,0,6),(1126,19,'2014-11-03',1414980780,1415017740,3),(1127,20,'2014-11-03',1414977660,1415016300,7),(1128,21,'2014-11-03',1414979340,1415016300,7),(1129,22,'2014-11-03',1414978680,1415017680,7),(1130,23,'2014-11-03',0,0,6),(1131,24,'2014-11-03',1414980360,1415014560,7),(1132,25,'2014-11-03',1414980240,1415010720,7),(1133,26,'2014-11-03',1414979280,1415012520,7),(1134,27,'2014-11-03',1414978860,1415012520,7),(1135,28,'2014-11-03',0,0,6),(1136,29,'2014-11-03',1414979280,1415010780,7),(1137,30,'2014-11-03',1414980300,1415012460,7),(1138,31,'2014-11-03',1414981440,1415012640,3),(1139,32,'2014-11-03',1414975620,1415012460,7),(1140,33,'2014-11-03',0,0,6),(1141,34,'2014-11-03',1414980120,1415013000,7),(1142,35,'2014-11-03',0,0,6),(1143,36,'2014-11-03',0,0,6),(1144,37,'2014-11-03',1414978980,1415017620,7),(1145,38,'2014-11-03',1414979880,1415014320,7),(1146,39,'2014-11-03',1414978920,1415013300,7),(1148,4,'2014-11-04',1415066640,1415101620,7),(1149,5,'2014-11-04',1415066040,1415099220,7),(1150,6,'2014-11-04',1415066280,1415099220,7),(1151,7,'2014-11-04',1415066640,1415102400,7),(1152,8,'2014-11-04',1415065020,1415100960,7),(1153,9,'2014-11-04',1415075460,1415100120,8),(1154,10,'2014-11-04',1415067960,1415099640,3),(1155,11,'2014-11-04',1415066640,0,5),(1156,12,'2014-11-04',1415066520,1415104920,7),(1157,13,'2014-11-04',1415066520,1415100120,7),(1158,14,'2014-11-04',1415066520,1415099760,7),(1159,15,'2014-11-04',0,0,6),(1160,16,'2014-11-04',1415066400,1415098800,7),(1161,17,'2014-11-04',1415066580,1415099940,7),(1162,18,'2014-11-04',0,0,6),(1163,19,'2014-11-04',1415067060,1415103060,3),(1164,20,'2014-11-04',1415063460,1415100480,7),(1165,21,'2014-11-04',1415066520,1415102520,7),(1166,22,'2014-11-04',1415064480,1415102520,7),(1167,23,'2014-11-04',0,0,6),(1168,24,'2014-11-04',1415066220,1415099820,7),(1169,25,'2014-11-04',1415066100,1415099340,7),(1170,26,'2014-11-04',1415065680,1415099340,7),(1171,27,'2014-11-04',1415064840,1415101500,1),(1172,28,'2014-11-04',0,0,6),(1173,29,'2014-11-04',1415065020,1415109480,7),(1174,30,'2014-11-04',1415066520,1415099340,7),(1175,31,'2014-11-04',1415066640,0,5),(1176,32,'2014-11-04',1415061840,1415104800,1),(1177,33,'2014-11-04',0,0,6),(1178,34,'2014-11-04',1415066580,1415101200,7),(1179,35,'2014-11-04',0,0,6),(1180,36,'2014-11-04',1415069520,0,5),(1181,37,'2014-11-04',1415064720,1415102520,7),(1182,38,'2014-11-04',1415066580,1415099640,7),(1183,39,'2014-11-04',1415065440,1415099580,7),(1185,4,'2014-11-05',1415152080,1415188500,7),(1186,5,'2014-11-05',1415152620,1415185440,7),(1187,6,'2014-11-05',1415152680,1415185440,7),(1188,7,'2014-11-05',1415152620,1415185740,7),(1189,8,'2014-11-05',1415151660,1415185500,7),(1190,9,'2014-11-05',0,0,6),(1191,10,'2014-11-05',1415155080,1415185500,3),(1192,11,'2014-11-05',1415153400,1415182320,4),(1193,12,'2014-11-05',1415153340,1415193180,7),(1194,13,'2014-11-05',0,0,6),(1195,14,'2014-11-05',1415153400,1415185320,7),(1196,15,'2014-11-05',0,0,6),(1197,16,'2014-11-05',1415152320,1415185260,7),(1198,17,'2014-11-05',1415153220,1415185560,7),(1199,18,'2014-11-05',0,0,6),(1200,19,'2014-11-05',1415153160,1415193120,7),(1201,20,'2014-11-05',1415150460,1415186520,7),(1202,21,'2014-11-05',0,1415188260,2),(1203,22,'2014-11-05',1415151000,1415186400,7),(1204,23,'2014-11-05',0,0,6),(1205,24,'2014-11-05',1415152320,1415186580,7),(1206,25,'2014-11-05',1415152680,1415186160,7),(1207,26,'2014-11-05',1415152440,1415185620,7),(1208,27,'2014-11-05',1415150880,1415187180,7),(1209,28,'2014-11-05',0,0,6),(1210,29,'2014-11-05',1415151180,1415185380,7),(1211,30,'2014-11-05',1415152980,1415185500,7),(1212,31,'2014-11-05',1415153040,1415190900,7),(1213,32,'2014-11-05',1415148600,1415191320,7),(1214,33,'2014-11-05',0,0,6),(1215,34,'2014-11-05',1415153280,1415193240,7),(1216,35,'2014-11-05',0,0,6),(1217,36,'2014-11-05',0,0,6),(1218,37,'2014-11-05',1415151840,1415186460,7),(1219,38,'2014-11-05',1415152860,1415185500,7),(1220,39,'2014-11-05',1415151720,1415186400,7),(1222,4,'2014-11-06',1415238720,1415275860,7),(1223,5,'2014-11-06',1415238960,1415271840,7),(1224,6,'2014-11-06',1415239260,1415271780,7),(1225,7,'2014-11-06',1415239560,1415275140,7),(1226,8,'2014-11-06',1415237520,1415275140,7),(1227,9,'2014-11-06',1415239920,1415276100,3),(1228,10,'2014-11-06',1415239620,1415273940,7),(1229,11,'2014-11-06',1415239740,1415272560,7),(1230,12,'2014-11-06',1415239320,1415275860,7),(1231,13,'2014-11-06',1415239920,1415272560,3),(1232,14,'2014-11-06',1415239320,1415272620,7),(1233,15,'2014-11-06',0,0,6),(1234,16,'2014-11-06',1415239800,1415271900,7),(1235,17,'2014-11-06',1415239020,1415272860,7),(1236,18,'2014-11-06',0,0,6),(1237,19,'2014-11-06',1415239620,1415274660,7),(1238,20,'2014-11-06',0,0,6),(1239,21,'2014-11-06',1415239080,1415274240,7),(1240,22,'2014-11-06',1415241780,1415274840,3),(1241,23,'2014-11-06',0,0,6),(1242,24,'2014-11-06',1415237400,1415257440,4),(1243,25,'2014-11-06',1415239140,1415273280,7),(1244,26,'2014-11-06',1415238600,1415273580,7),(1245,27,'2014-11-06',1415237640,1415275080,7),(1246,28,'2014-11-06',0,0,6),(1247,29,'2014-11-06',1415238120,1415279700,7),(1248,30,'2014-11-06',1415239320,1415271840,7),(1249,31,'2014-11-06',1415241060,1415275080,3),(1250,32,'2014-11-06',1415234460,1415284440,7),(1251,33,'2014-11-06',0,0,6),(1252,34,'2014-11-06',1415239260,1415284500,7),(1253,35,'2014-11-06',0,0,6),(1254,36,'2014-11-06',0,0,6),(1255,37,'2014-11-06',1415238060,1415272920,7),(1256,38,'2014-11-06',1415239620,1415273940,7),(1257,39,'2014-11-06',1415238600,1415275140,7),(1259,4,'2014-11-07',1415325540,0,5),(1260,5,'2014-11-07',1415325480,0,5),(1261,6,'2014-11-07',1415325660,0,5),(1262,7,'2014-11-07',1415326140,0,5),(1263,8,'2014-11-07',1415324280,0,5),(1264,9,'2014-11-07',1415325000,0,5),(1265,10,'2014-11-07',1415327160,0,5),(1266,11,'2014-11-07',1415326080,0,5),(1267,12,'2014-11-07',1415326020,0,5),(1268,13,'2014-11-07',1415325000,0,5),(1269,14,'2014-11-07',1415326440,0,5),(1270,15,'2014-11-07',0,0,6),(1271,16,'2014-11-07',1415325000,0,5),(1272,17,'2014-11-07',1415324400,0,5),(1273,18,'2014-11-07',0,0,6),(1274,19,'2014-11-07',1415328780,0,5),(1275,20,'2014-11-07',1415324100,0,5),(1276,21,'2014-11-07',1415325000,0,5),(1277,22,'2014-11-07',1415323620,0,5),(1278,23,'2014-11-07',0,0,6),(1279,24,'2014-11-07',1415324520,0,5),(1280,25,'2014-11-07',1415325900,0,5),(1281,26,'2014-11-07',1415325300,0,5),(1282,27,'2014-11-07',1415322660,0,7),(1283,28,'2014-11-07',0,0,6),(1284,29,'2014-11-07',1415324100,0,5),(1285,30,'2014-11-07',1415326080,0,5),(1286,31,'2014-11-07',1415326020,0,5),(1287,32,'2014-11-07',1415321460,0,1),(1288,33,'2014-11-07',0,0,6),(1289,34,'2014-11-07',1415326140,0,5),(1290,35,'2014-11-07',0,0,6),(1291,36,'2014-11-07',0,0,6),(1292,37,'2014-11-07',1415324280,0,5),(1293,38,'2014-11-07',1415325480,1415352240,4),(1294,39,'2014-11-07',1415325000,0,5),(2591,4,'2014-11-08',1415416680,1415440440,10),(2592,5,'2014-11-08',1415415300,1415432100,9),(2593,6,'2014-11-08',1415420160,1415444400,8),(2594,7,'2014-11-08',1415413380,1415444400,3),(2595,8,'2014-11-08',1415410260,1415444460,7),(2596,9,'2014-11-08',0,1415440440,2),(2597,10,'2014-11-08',1415420340,1415444460,8),(2598,11,'2014-11-08',1415412480,1415444700,7),(2599,12,'2014-11-08',1415415180,1415445480,3),(2600,13,'2014-11-08',1415412660,1415440440,9),(2601,14,'2014-11-08',1415416320,1415444400,8),(2602,15,'2014-11-08',0,0,6),(2603,16,'2014-11-08',1415416260,1415444520,8),(2604,17,'2014-11-08',1415411940,1415440440,4),(2605,18,'2014-11-08',0,0,6),(2606,19,'2014-11-08',0,0,6),(2607,20,'2014-11-08',1415410560,1415442720,7),(2608,21,'2014-11-08',1415413200,1415444220,3),(2609,22,'2014-11-08',1415410860,1415442720,7),(2610,23,'2014-11-08',0,0,6),(2611,24,'2014-11-08',1415411340,0,5),(2612,25,'2014-11-08',1415415120,0,5),(2613,26,'2014-11-08',1415411760,1415443200,7),(2614,27,'2014-11-08',1415411880,1415443380,7),(2615,28,'2014-11-08',0,0,6),(2616,29,'2014-11-08',1415410800,1415444400,7),(2617,30,'2014-11-08',1415417340,1415444460,8),(2618,31,'2014-11-08',1415413320,1415444160,3),(2619,32,'2014-11-08',1415410260,1415444400,6),(2620,33,'2014-11-08',0,0,6),(2621,34,'2014-11-08',1415412540,1415445420,7),(2622,35,'2014-11-08',0,0,6),(2623,36,'2014-11-08',0,0,6),(2624,37,'2014-11-08',1415410980,1415442720,7),(2625,38,'2014-11-08',0,0,6),(2626,39,'2014-11-08',1415411040,1415443080,7),(2664,40,'2014-09-24',1411523340,1411557420,7),(2701,40,'2014-09-25',1411609740,1411643040,7),(2738,40,'2014-09-26',1411696740,1411729320,7),(2775,40,'2014-09-27',1411784280,1411815780,3),(2812,40,'2014-09-29',1411955820,1411989720,7),(2849,40,'2014-09-30',1412041620,1412074980,7),(2886,40,'2014-10-06',1412560320,1412593320,7),(2923,40,'2014-10-07',1412646540,1412679720,7),(2960,40,'2014-10-08',1412733060,1412766120,7),(2997,40,'2014-10-09',1412819340,1412852460,7),(3034,40,'2014-10-10',1412906160,1412938920,7),(3071,40,'2014-10-11',1412993460,1413025500,3),(3108,40,'2014-10-13',1413164640,1413198180,7),(3145,40,'2014-10-14',1413251820,1413284460,7),(3182,40,'2014-10-15',1413338640,1413370920,7),(3219,40,'2014-10-16',1413424440,1413457380,7),(3256,40,'2014-10-17',1413510060,1413543960,7),(3293,40,'2014-10-18',1413598980,1413630060,3),(3330,40,'2014-10-20',1413770340,1413802920,7),(3367,40,'2014-10-21',1413856560,1413889320,7),(3404,40,'2014-10-22',1413942660,1413975780,7),(3441,40,'2014-10-23',1414029480,1414063140,7),(3478,40,'2014-10-24',1414115640,1414148820,7),(3515,40,'2014-10-25',1414206480,1414234920,8),(3552,40,'2014-10-27',1414375440,1414407780,7),(3589,40,'2014-10-28',1414461300,1414494300,7),(3626,40,'2014-10-29',1414547820,1414580640,7),(3663,40,'2014-10-30',1414634220,1414666980,7),(3700,40,'2014-10-31',1414720500,1414753380,7),(3737,40,'2014-11-01',1414812060,1414839420,8),(3774,40,'2014-11-03',1414979880,1415012400,7),(3811,40,'2014-11-04',1415065920,1415099760,7),(3848,40,'2014-11-05',1415152320,1415185320,7),(3885,40,'2014-11-06',1415238660,1415271900,7),(3922,40,'2014-11-07',1415324880,1415358060,7),(3959,40,'2014-11-08',1415412180,1415444280,7),(3960,27,'2014-11-14',0,0,1),(5293,32,'2014-11-27',0,0,1);
/*!40000 ALTER TABLE `yy_member_attendance` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_attribute`
--

DROP TABLE IF EXISTS `yy_member_attribute`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_attribute` (
  `uid` int(10) unsigned NOT NULL COMMENT '用户ID',
  `salary` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '员工月薪',
  `social_index` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '社保基数',
  `mortgage_index` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '公积金基数',
  `persontax_index` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '个人所得税基数',
  `not_attendance` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '不需要考勤',
  `not_salary` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '不需要发工资',
  `salary_index` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '工资的基数',
  UNIQUE KEY `uid` (`uid`),
  CONSTRAINT `member_attribute_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='员工公司相关属性表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_attribute`
--

LOCK TABLES `yy_member_attribute` WRITE;
/*!40000 ALTER TABLE `yy_member_attribute` DISABLE KEYS */;
INSERT INTO `yy_member_attribute` VALUES (1,6000,300,300,6000,1,1,0),(2,5000,200,300,5000,1,0,0),(3,4000,300,200,4000,1,0,0),(4,4000,200,300,4000,0,0,0),(5,5500,200,300,5500,0,0,0),(6,5000,200,100,5000,0,0,0),(7,4500,200,200,4500,0,0,0),(8,3000,200,300,3000,0,0,0),(9,3500,200,300,3500,0,0,0),(10,3000,200,300,3000,0,0,0),(11,5000,200,300,5000,0,0,0),(12,4000,300,200,4000,0,0,0),(13,4000,200,300,4000,0,0,0),(14,5500,200,300,5500,0,0,0),(15,4500,200,200,4500,0,0,0),(16,3000,200,300,3000,0,0,0),(17,3500,200,300,3500,0,0,0),(18,3000,200,300,3000,0,0,0),(19,3000,200,300,3000,0,0,0),(20,5000,200,300,5000,0,0,0),(21,4000,300,200,4000,0,0,0),(22,4000,200,300,4000,0,0,0),(23,5500,200,300,5500,0,0,0),(24,4500,200,200,4500,0,0,0),(25,3000,200,300,3000,0,0,0),(26,3500,200,300,3500,0,0,2000),(27,3000,200,300,3000,0,0,0),(28,3000,200,300,3000,0,0,0),(29,5000,200,300,5000,0,0,0),(30,4000,300,200,4000,0,0,0),(31,4000,200,300,4000,0,0,0),(32,1000000,200,300,5500,0,0,3500),(33,10000000,200,200,4500,0,0,0),(34,3000,200,300,3000,0,0,0),(35,3500,200,300,3500,0,0,0),(36,3000,200,300,3000,0,0,0),(37,3000,200,300,3000,0,0,0),(38,5000,200,300,5000,0,0,0),(39,3000,200,200,3000,0,0,2000),(40,0,0,0,0,0,0,0);
/*!40000 ALTER TABLE `yy_member_attribute` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_deal`
--

DROP TABLE IF EXISTS `yy_member_deal`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_deal` (
  `did` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `uid` int(10) unsigned NOT NULL COMMENT '员工ID',
  `gettime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '接到事务的时间',
  `overtime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '处理完毕事务的时间',
  `lasttime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '最后处理事务的时间',
  `type` mediumint(5) unsigned NOT NULL DEFAULT '0' COMMENT '1销假 2待增',
  `title` varchar(200) NOT NULL DEFAULT '' COMMENT '标题',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1未查看 2处理中 3处理成功 4处理失败',
  `url` varchar(200) NOT NULL DEFAULT '' COMMENT '详情的链接',
  `ajax` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否是ajax加载',
  PRIMARY KEY (`did`),
  KEY `member_deal_uid` (`uid`),
  CONSTRAINT `member_deal_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8 COMMENT='事务处理类型表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_deal`
--

LOCK TABLES `yy_member_deal` WRITE;
/*!40000 ALTER TABLE `yy_member_deal` DISABLE KEYS */;
INSERT INTO `yy_member_deal` VALUES (1,27,1414837819,1415248452,1415248452,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/1.html',1),(2,27,1415246976,1415333246,1415333246,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/12.html',1),(3,27,1415248410,0,1415248410,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/13.html',1),(4,8,1415269374,0,1415269374,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/14.html',1),(5,7,1415332756,0,1415332756,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/18.html',1),(6,8,1415337410,0,1415337410,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/19.html',1),(7,8,1415337858,1415337868,1415337868,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/20.html',1),(8,5,1415337991,1415338003,1415338003,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/21.html',1),(9,7,1415339507,0,1415339507,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/22.html',1),(10,5,1415341676,1415423689,1415423689,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/24.html',1),(11,34,1415349185,1415413458,1415413458,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/29.html',1),(12,32,1415349195,0,1415349195,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/28.html',1),(13,32,1415349203,0,1415349203,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/27.html',1),(14,32,1415349211,1415599902,1415599902,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/26.html',1),(15,32,1415349218,1415599890,1415599890,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/25.html',1),(16,5,1415351638,1415423696,1415423696,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/32.html',1),(17,32,1415425748,0,1415425748,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/33.html',1),(18,32,1415426102,0,1415426102,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/34.html',1),(19,34,1415426835,0,1415426835,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/36.html',1),(20,26,1415426881,1415426898,1415426898,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/35.html',1),(21,5,1415434445,0,1415434445,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/43.html',1),(24,5,1415436346,0,1415436346,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/45.html',1),(25,5,1415439494,0,1415439494,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/47.html',1),(26,27,1415590062,0,1415590062,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/48.html',1),(27,27,1415591008,0,1415591008,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/49.html',1),(28,32,1415603363,0,1415603363,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/58.html',1),(29,32,1415603861,0,1415603861,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/59.html',1),(30,32,1415604063,0,1415604063,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/60.html',1),(31,34,1415604794,0,1415604794,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/63.html',1),(32,39,1415605137,0,1415605137,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/64.html',1),(33,39,1415605892,1415605934,1415605934,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/65.html',1),(34,32,1415606655,0,1415606655,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/61.html',1),(35,32,1415606891,0,1415606891,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/67.html',1),(36,32,1415607022,1415607083,1415607083,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/62.html',1),(37,39,1415607060,0,1415607060,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/68.html',1),(38,27,1415607217,0,1415607217,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/70.html',1),(39,32,1415607342,0,1415607342,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/69.html',1),(40,39,1415607459,0,1415607459,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/71.html',1),(41,34,1415607490,1415607513,1415607513,1,'销假办理单',3,'/Home/Nvacation/unsetApply/aid/72.html',1),(42,34,1415609316,0,1415609316,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/74.html',1),(43,31,1415609496,0,1415609496,1,'销假办理单',1,'/Home/Nvacation/unsetApply/aid/76.html',1);
/*!40000 ALTER TABLE `yy_member_deal` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_info`
--

DROP TABLE IF EXISTS `yy_member_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_info` (
  `uid` int(10) unsigned NOT NULL COMMENT '用户ID',
  `email` varchar(200) NOT NULL DEFAULT '' COMMENT '用户邮箱',
  `idcard` varchar(30) NOT NULL DEFAULT '' COMMENT '身份证号',
  `salarybank` varchar(50) NOT NULL DEFAULT '' COMMENT '工资卡卡号',
  `cashbank` varchar(50) NOT NULL DEFAULT '' COMMENT '现金卡卡号',
  UNIQUE KEY `uid` (`uid`),
  CONSTRAINT `member_info_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='员工详细信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_info`
--

LOCK TABLES `yy_member_info` WRITE;
/*!40000 ALTER TABLE `yy_member_info` DISABLE KEYS */;
INSERT INTO `yy_member_info` VALUES (1,'','','','');
/*!40000 ALTER TABLE `yy_member_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_privilege`
--

DROP TABLE IF EXISTS `yy_member_privilege`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_privilege` (
  `uid` int(10) unsigned NOT NULL COMMENT '用户ID',
  `pid` int(10) unsigned NOT NULL COMMENT '权限ID',
  `cando` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '0不能执行 1能执行',
  PRIMARY KEY (`uid`,`pid`),
  KEY `member_privilege_pid` (`pid`),
  CONSTRAINT `member_privilege_pid` FOREIGN KEY (`pid`) REFERENCES `yy_privilege` (`pid`),
  CONSTRAINT `member_privilege_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='员工权限表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_privilege`
--

LOCK TABLES `yy_member_privilege` WRITE;
/*!40000 ALTER TABLE `yy_member_privilege` DISABLE KEYS */;
/*!40000 ALTER TABLE `yy_member_privilege` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_salary`
--

DROP TABLE IF EXISTS `yy_member_salary`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_salary` (
  `sid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `uid` int(10) unsigned NOT NULL COMMENT '员工ID',
  `year` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '哪一年的',
  `month` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '哪一月的',
  `mustwork` decimal(3,1) unsigned NOT NULL DEFAULT '0.0' COMMENT '理论上应该工作的天数',
  `realwork` decimal(3,1) unsigned NOT NULL DEFAULT '0.0' COMMENT '员工每月实际工作的天数',
  `deduct_social` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '扣除的社保',
  `deduct_mortgage` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '扣除的公积金',
  `deduct_attendance` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '扣除的考勤',
  `deduct_persontax` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '扣除的个税',
  `deduct_other` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '扣除的其他',
  `reward` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '奖金',
  `money` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '公司规定的工资',
  `salary` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '最终能拿到的工资',
  `reward_note` varchar(500) NOT NULL DEFAULT '' COMMENT '奖金备注',
  `deduct_note` varchar(500) NOT NULL DEFAULT '' COMMENT '扣款备注',
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1刚导入 2填充完成 3审批通过 4审批失败 5已发布',
  PRIMARY KEY (`sid`),
  UNIQUE KEY `uid` (`uid`,`year`,`month`),
  CONSTRAINT `member_salary_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=510 DEFAULT CHARSET=utf8 COMMENT='员工月薪统计表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_salary`
--

LOCK TABLES `yy_member_salary` WRITE;
/*!40000 ALTER TABLE `yy_member_salary` DISABLE KEYS */;
INSERT INTO `yy_member_salary` VALUES (1,13,2014,10,22.0,20.5,22.00,18.00,270.00,13.00,0.00,2000.00,4000.00,5677.00,'1','',2),(2,20,2014,10,22.0,19.0,22.00,18.00,680.00,43.00,200.00,0.00,5000.00,4237.00,'','4',2),(3,24,2014,10,22.0,21.0,22.00,12.00,234.00,28.00,150.00,0.00,4500.00,4204.00,'','5',2),(4,26,2014,10,22.0,21.5,22.00,18.00,79.00,0.00,8888.00,8000.00,3500.00,11381.00,'2','',2),(5,27,2014,10,22.0,21.0,22.00,18.00,136.00,0.00,0.00,5000.00,3000.00,7824.00,'3','',2),(6,1,2014,10,22.0,22.0,33.00,18.00,0.00,139.00,0.00,0.00,6000.00,5810.00,'','',2),(7,2,2014,10,22.0,22.0,22.00,18.00,0.00,43.00,0.00,0.00,5000.00,4917.00,'','',2),(8,3,2014,10,22.0,22.0,33.00,12.00,0.00,13.00,0.00,0.00,4000.00,3942.00,'','',2),(9,4,2014,10,22.0,16.5,22.00,18.00,1102.00,13.00,0.00,0.00,4000.00,2845.00,'','',2),(10,5,2014,10,22.0,17.0,22.00,18.00,1340.00,91.00,0.00,0.00,5500.00,4029.00,'','',2),(11,6,2014,10,22.0,20.0,22.00,6.00,452.00,44.00,0.00,0.00,5000.00,4476.00,'','',2),(12,7,2014,10,22.0,20.5,22.00,12.00,396.00,28.00,0.00,0.00,4500.00,4042.00,'','',2),(13,8,2014,10,22.0,22.0,22.00,18.00,0.00,0.00,0.00,0.00,3000.00,2960.00,'','',2),(14,9,2014,10,22.0,17.5,22.00,18.00,712.00,0.00,0.00,0.00,3500.00,2748.00,'','',2),(15,10,2014,10,22.0,21.0,22.00,18.00,366.00,0.00,0.00,0.00,3000.00,2594.00,'','',2),(16,11,2014,10,22.0,16.5,22.00,18.00,1478.00,43.00,0.00,0.00,5000.00,3439.00,'','',2),(17,12,2014,10,22.0,20.0,33.00,12.00,670.00,13.00,0.00,0.00,4000.00,3272.00,'','',2),(18,14,2014,10,22.0,20.5,22.00,18.00,375.00,91.00,0.00,0.00,5500.00,4994.00,'','',2),(19,15,2014,10,22.0,0.0,22.00,12.00,4488.00,28.00,0.00,0.00,4500.00,-50.00,'0','0',2),(20,16,2014,10,22.0,19.0,22.00,18.00,518.00,0.00,0.00,0.00,3000.00,2442.00,'','',2),(21,17,2014,10,22.0,21.5,22.00,18.00,79.00,0.00,0.00,0.00,3500.00,3381.00,'','',2),(22,18,2014,10,22.0,0.0,22.00,18.00,2992.00,0.00,0.00,0.00,3000.00,-32.00,'','',2),(23,19,2014,10,22.0,20.0,22.00,18.00,392.00,0.00,0.00,0.00,3000.00,2568.00,'','',2),(24,21,2014,10,22.0,21.5,33.00,12.00,90.00,13.00,0.00,0.00,4000.00,3852.00,'','',2),(25,22,2014,10,22.0,22.0,22.00,18.00,0.00,13.00,0.00,0.00,4000.00,3947.00,'','',2),(26,23,2014,10,22.0,0.0,22.00,18.00,5500.00,91.00,0.00,0.00,5500.00,-131.00,'','',2),(27,25,2014,10,22.0,18.0,22.00,18.00,544.00,0.00,0.00,0.00,3000.00,2416.00,'','',2),(28,28,2014,10,22.0,0.0,22.00,18.00,2992.00,0.00,0.00,0.00,3000.00,-32.00,'','',2),(29,29,2014,10,22.0,18.0,22.00,18.00,938.00,43.00,0.00,0.00,5000.00,3979.00,'','',2),(30,30,2014,10,22.0,21.0,33.00,12.00,180.00,13.00,0.00,0.00,4000.00,3762.00,'','',2),(31,31,2014,10,22.0,16.0,22.00,18.00,1402.00,13.00,0.00,0.00,4000.00,2545.00,'','',2),(32,32,2014,10,22.0,16.5,22.00,18.00,249997.00,91.00,0.00,2000.00,999999.99,751872.00,'','',2),(33,33,2014,10,22.0,0.0,22.00,12.00,999999.99,28.00,0.00,0.00,999999.99,-52.00,'','',2),(34,34,2014,10,22.0,19.0,22.00,18.00,468.00,0.00,0.00,0.00,3000.00,2492.00,'','',2),(35,35,2014,10,22.0,17.0,22.00,18.00,883.00,0.00,0.00,0.00,3500.00,2577.00,'','',2),(36,36,2014,10,22.0,0.0,22.00,18.00,2992.00,0.00,0.00,0.00,3000.00,-32.00,'','',2),(37,37,2014,10,22.0,18.5,22.00,18.00,476.00,0.00,0.00,0.00,3000.00,2484.00,'','',2),(38,38,2014,10,22.0,21.0,22.00,18.00,226.00,43.00,0.00,0.00,5000.00,4691.00,'','',2),(39,39,2014,10,22.0,20.0,22.00,12.00,272.00,0.00,30.00,20.00,3000.00,2714.00,'test奖金说明','test扣款说明',2),(159,40,2014,10,22.0,21.5,0.00,0.00,30.00,0.00,0.00,0.00,0.00,-30.00,'','',2);
/*!40000 ALTER TABLE `yy_member_salary` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_verify`
--

DROP TABLE IF EXISTS `yy_member_verify`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_verify` (
  `vid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '人员配置ID',
  `title` varchar(50) NOT NULL DEFAULT '' COMMENT '该审批配置的名称',
  `sid` int(10) unsigned NOT NULL COMMENT '配置ID',
  `did` int(10) unsigned NOT NULL COMMENT '部门ID',
  `uid` int(10) unsigned NOT NULL COMMENT '领导ID',
  `dealorder` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '处理顺序',
  PRIMARY KEY (`vid`),
  UNIQUE KEY `sid` (`sid`,`uid`,`did`),
  KEY `member_verify_uid` (`uid`),
  KEY `member_verify_did` (`did`),
  CONSTRAINT `member_verify_did` FOREIGN KEY (`did`) REFERENCES `yy_department` (`did`),
  CONSTRAINT `member_verify_sid` FOREIGN KEY (`sid`) REFERENCES `yy_member_verify_setting` (`sid`),
  CONSTRAINT `member_verify_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8 COMMENT='审批人员表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_verify`
--

LOCK TABLES `yy_member_verify` WRITE;
/*!40000 ALTER TABLE `yy_member_verify` DISABLE KEYS */;
INSERT INTO `yy_member_verify` VALUES (2,'手游事业部假期审批',2,3,18,1),(3,'考勤更正申请',3,2,18,1),(4,'考勤更正申请',3,2,35,2),(13,'休息',3,2,1,1),(14,'123123',2,5,4,1),(16,'456436',3,4,5,1),(21,'手游考勤更正审批设置',3,3,18,1),(35,'薪资审批',1,1,1,1),(40,'假期审批',2,7,31,1),(42,'考勤修改',3,7,31,1),(43,'假期',2,2,39,1);
/*!40000 ALTER TABLE `yy_member_verify` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_verify_response`
--

DROP TABLE IF EXISTS `yy_member_verify_response`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_verify_response` (
  `rid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '处理ID',
  `uid` int(10) unsigned NOT NULL COMMENT '领导ID',
  `sid` int(10) unsigned NOT NULL COMMENT '审批配置ID',
  `id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '处理哪件事的ID，根据情况变化',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '审批时间',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1同意 2驳回',
  `info` varchar(1000) NOT NULL DEFAULT '' COMMENT '驳回的理由',
  `dealorder` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '第几个处理,从1开始',
  PRIMARY KEY (`rid`),
  UNIQUE KEY `uid` (`uid`,`id`),
  KEY `member_verify_response_sid` (`sid`),
  CONSTRAINT `member_verify_response_sid` FOREIGN KEY (`sid`) REFERENCES `yy_member_verify_setting` (`sid`),
  CONSTRAINT `member_verify_response_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=132 DEFAULT CHARSET=utf8 COMMENT='审批人员表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_verify_response`
--

LOCK TABLES `yy_member_verify_response` WRITE;
/*!40000 ALTER TABLE `yy_member_verify_response` DISABLE KEYS */;
INSERT INTO `yy_member_verify_response` VALUES (1,1,1,1,1414834652,1,'',1),(2,1,1,2,1414836194,1,'',1),(3,1,1,3,1414836970,1,'',1),(4,1,1,4,1414837533,1,'',1),(5,18,2,1,1414837819,1,'',1),(6,18,3,7,1414839132,1,'',1),(7,18,3,6,1414839138,1,'',1),(8,18,3,5,1414839145,1,'',1),(9,35,3,7,1414839219,1,'',2),(10,35,3,6,1414839225,1,'',2),(11,35,3,5,1414839239,2,'真的吗',2),(12,1,2,5,1415243564,1,'',1),(13,1,2,12,1415246080,1,'',1),(14,3,2,12,1415246917,1,'',2),(15,18,2,12,1415246975,1,'',3),(17,1,2,13,1415248130,1,'',1),(18,3,2,13,1415248369,1,'',2),(19,18,2,13,1415248410,1,'',3),(20,1,2,14,1415269227,1,'',1),(24,3,2,14,1415269374,1,'',2),(28,1,2,18,1415332756,1,'',1),(29,1,2,11,1415332772,2,'test',1),(30,1,2,19,1415337410,1,'',1),(31,1,2,20,1415337858,1,'',1),(32,1,2,21,1415337991,1,'',1),(33,1,2,22,1415339278,1,'',1),(34,3,2,22,1415339507,1,'',2),(35,1,2,23,1415341325,2,'不同意',1),(36,1,2,24,1415341646,1,'',1),(37,3,2,24,1415341676,1,'',2),(38,1,2,30,1415348725,1,'',1),(39,5,3,14,1415348888,2,'太臭了',1),(40,1,2,29,1415349185,1,'',1),(41,1,2,28,1415349195,1,'',1),(42,1,2,27,1415349203,1,'',1),(43,1,2,26,1415349211,0,'',1),(44,1,2,25,1415349218,1,'',1),(45,1,2,32,1415351601,1,'',1),(46,3,2,32,1415351638,1,'',2),(47,1,2,8,1415352439,2,'你奏凯',1),(48,18,3,18,1415423922,1,'',1),(49,1,1,15,1415425169,1,'',1),(50,1,2,33,1415425748,0,'',1),(51,1,1,16,1415425884,1,'',1),(52,1,2,34,1415426102,1,'',1),(73,1,2,35,1415426797,1,'',1),(75,1,2,36,1415426835,0,'',1),(77,18,2,35,1415426881,1,'',2),(78,32,3,32,1415428120,1,'',1),(79,32,3,33,1415428154,1,'',1),(80,1,2,37,1415428773,1,'',1),(81,3,2,43,1415434445,1,'',1),(84,3,2,45,1415436346,1,'',1),(87,3,2,46,1415437321,2,'情猫',1),(88,3,2,47,1415439493,1,'',1),(89,18,3,36,1415589048,1,'',1),(90,18,2,48,1415590062,1,'',1),(91,18,2,49,1415591008,1,'',1),(92,18,2,51,1415599099,1,'',1),(93,31,2,52,1415600442,1,'',1),(94,31,2,53,1415600668,1,'',1),(95,7,2,53,1415600818,2,'请假事由请假事由',2),(96,31,2,55,1415600869,1,'',1),(97,31,2,56,1415601078,1,'',1),(98,31,3,38,1415602456,1,'',1),(99,31,3,39,1415602559,1,'',1),(100,31,3,40,1415602920,1,'',1),(101,31,2,57,1415603130,1,'',1),(102,31,2,58,1415603363,1,'',1),(103,31,2,59,1415603861,1,'',1),(104,31,3,41,1415603915,1,'',1),(105,31,2,60,1415604063,1,'',1),(106,31,3,42,1415604566,1,'',1),(107,31,3,43,1415604702,1,'',1),(108,31,2,63,1415604794,1,'',1),(109,3,2,64,1415605137,1,'',1),(110,3,2,65,1415605891,1,'',1),(111,31,2,66,1415606355,1,'',1),(112,31,2,61,1415606654,1,'',1),(113,31,2,67,1415606891,1,'',1),(114,31,2,62,1415607022,1,'',1),(115,3,2,68,1415607060,1,'',1),(116,18,2,70,1415607217,1,'',1),(117,31,3,44,1415607335,1,'',1),(118,31,2,69,1415607342,1,'',1),(119,3,2,71,1415607459,1,'',1),(120,31,2,72,1415607489,1,'',1),(121,31,3,45,1415607684,1,'',1),(122,31,2,73,1415607747,1,'',1),(123,39,2,75,1415608545,1,'',1),(124,31,2,74,1415609316,1,'',1),(125,31,3,46,1415609394,1,'',1),(126,31,2,76,1415609496,1,'',1),(127,31,3,47,1415609548,1,'',1),(128,31,3,48,1415609711,1,'',1),(129,31,3,49,1415611316,1,'',1);
/*!40000 ALTER TABLE `yy_member_verify_response` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_member_verify_setting`
--

DROP TABLE IF EXISTS `yy_member_verify_setting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_member_verify_setting` (
  `sid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '配置ID',
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '类型,用中文',
  `module` varchar(50) NOT NULL DEFAULT '' COMMENT '处理该审批的模型',
  PRIMARY KEY (`sid`),
  UNIQUE KEY `name` (`name`),
  UNIQUE KEY `module` (`module`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='审批配置表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_member_verify_setting`
--

LOCK TABLES `yy_member_verify_setting` WRITE;
/*!40000 ALTER TABLE `yy_member_verify_setting` DISABLE KEYS */;
INSERT INTO `yy_member_verify_setting` VALUES (1,'薪资审批','SalaryApply'),(2,'假期审批','VacationApply'),(3,'考勤更正申请','AttendanceApply');
/*!40000 ALTER TABLE `yy_member_verify_setting` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_position`
--

DROP TABLE IF EXISTS `yy_position`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_position` (
  `pid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '职位ID',
  `name` varchar(200) NOT NULL DEFAULT '' COMMENT '职位名称',
  `showorder` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '显示顺序',
  PRIMARY KEY (`pid`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8 COMMENT='职位表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_position`
--

LOCK TABLES `yy_position` WRITE;
/*!40000 ALTER TABLE `yy_position` DISABLE KEYS */;
INSERT INTO `yy_position` VALUES (1,'CEO',1),(2,'总经理',1),(3,'部门总经理',2),(4,'大大大',3),(5,'总监',3),(6,'开发工程师',4),(7,'游戏策划',1),(8,'商务',5),(9,'游戏测试',4),(10,'司机',5),(11,'项目助理',4),(12,'游戏原画',5),(13,'平面设计',5),(14,'游戏运营',5),(15,'系统维护',5);
/*!40000 ALTER TABLE `yy_position` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_privilege`
--

DROP TABLE IF EXISTS `yy_privilege`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_privilege` (
  `pid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '权限ID',
  `name` varchar(200) NOT NULL DEFAULT '' COMMENT '操作名称',
  `module` varchar(50) NOT NULL DEFAULT '' COMMENT '模型',
  `controller` varchar(50) NOT NULL DEFAULT '' COMMENT '控制器',
  `action` varchar(50) NOT NULL DEFAULT '' COMMENT '操作',
  PRIMARY KEY (`pid`),
  UNIQUE KEY `module` (`module`,`controller`,`action`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='权限表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_privilege`
--

LOCK TABLES `yy_privilege` WRITE;
/*!40000 ALTER TABLE `yy_privilege` DISABLE KEYS */;
/*!40000 ALTER TABLE `yy_privilege` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_salary_apply`
--

DROP TABLE IF EXISTS `yy_salary_apply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_salary_apply` (
  `aid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '申请ID',
  `uid` int(10) unsigned NOT NULL COMMENT '员工ID',
  `year` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '哪一年的',
  `month` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '哪一月的',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '提交申请的时间',
  `process` tinyint(1) NOT NULL DEFAULT '0' COMMENT '-1成功  -2失败 0未审核 1审核人1 2审核人2以此类推',
  `howmany` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '总共几个人处理',
  PRIMARY KEY (`aid`),
  UNIQUE KEY `uid` (`uid`,`year`,`month`),
  CONSTRAINT `salary_apply_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8 COMMENT='假期申请表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_salary_apply`
--

LOCK TABLES `yy_salary_apply` WRITE;
/*!40000 ALTER TABLE `yy_salary_apply` DISABLE KEYS */;
INSERT INTO `yy_salary_apply` VALUES (4,39,2014,9,1414837223,-1,0),(16,26,2014,10,1415425836,-1,0);
/*!40000 ALTER TABLE `yy_salary_apply` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_salary_log`
--

DROP TABLE IF EXISTS `yy_salary_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_salary_log` (
  `logid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `uid` int(10) unsigned NOT NULL COMMENT '操作者ID',
  `sid` int(10) unsigned NOT NULL COMMENT '记录ID',
  `info` varchar(200) NOT NULL DEFAULT '' COMMENT '说明',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '操作的时间',
  PRIMARY KEY (`logid`),
  KEY `salary_log_uid` (`uid`),
  KEY `salary_log_sid` (`sid`),
  CONSTRAINT `salary_log_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`),
  CONSTRAINT `salary_log_sid` FOREIGN KEY (`sid`) REFERENCES `yy_member_salary` (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='系统日志表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_salary_log`
--

LOCK TABLES `yy_salary_log` WRITE;
/*!40000 ALTER TABLE `yy_salary_log` DISABLE KEYS */;
INSERT INTO `yy_salary_log` VALUES (1,26,4,'黄维2014-11-10将您本月的考勤扣款由79.00改为179.00;其他扣款由0.00改为0.00;奖金由8000.00改为8000.00;',1415599167),(2,26,4,'黄维2014-11-10将您本月的其他扣款由0.00改为8888;奖金由8000.00改为8000.00;',1415599935);
/*!40000 ALTER TABLE `yy_salary_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_system_log`
--

DROP TABLE IF EXISTS `yy_system_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_system_log` (
  `logid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '记录ID',
  `uid` int(10) unsigned NOT NULL COMMENT '操作者ID',
  `targetuid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '操作者ID',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '类型名称',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '操作的时间',
  `info` varchar(200) NOT NULL DEFAULT '' COMMENT '说明',
  PRIMARY KEY (`logid`),
  KEY `system_log_uid` (`uid`),
  CONSTRAINT `system_log_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='系统日志表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_system_log`
--

LOCK TABLES `yy_system_log` WRITE;
/*!40000 ALTER TABLE `yy_system_log` DISABLE KEYS */;
INSERT INTO `yy_system_log` VALUES (1,27,0,'修改考勤结果',1415589110,'修改考勤id为1282的记录，将状态改为7'),(2,26,0,'修改考勤结果',1415589134,'修改考勤id为194的记录，将状态改为7'),(3,35,0,'修改考勤结果',1415598886,'修改考勤id为1097的记录，将状态改为2'),(4,35,0,'修改考勤结果',1415598901,'修改考勤id为1097的记录，将状态改为7'),(5,26,26,'事务处理',1415599167,'黄维2014-11-10将您本月的考勤扣款由79.00改为179.00;其他扣款由0.00改为0.00;奖金由8000.00改为8000.00;'),(6,26,26,'事务处理',1415599935,'黄维2014-11-10将您本月的其他扣款由0.00改为8888;奖金由8000.00改为8000.00;'),(7,35,0,'修改考勤结果',1415603785,'修改考勤id为1102的记录，将状态改为6');
/*!40000 ALTER TABLE `yy_system_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_system_setting`
--

DROP TABLE IF EXISTS `yy_system_setting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_system_setting` (
  `skey` varchar(50) NOT NULL DEFAULT '' COMMENT '配置键',
  `svalue` text COMMENT '配置的值',
  UNIQUE KEY `skey` (`skey`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='全局配置表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_system_setting`
--

LOCK TABLES `yy_system_setting` WRITE;
/*!40000 ALTER TABLE `yy_system_setting` DISABLE KEYS */;
INSERT INTO `yy_system_setting` VALUES ('allowance','2'),('housefund','a:2:{s:4:\"self\";s:2:\"6%\";s:4:\"comp\";s:2:\"6%\";}'),('ratio','a:2:{s:4:\"self\";a:3:{i:0;s:2:\"8%\";i:1;s:2:\"2%\";i:2;s:2:\"1%\";}s:4:\"comp\";a:6:{i:0;s:3:\"20%\";i:1;s:4:\"6.5%\";i:2;s:4:\"6.5%\";i:3;s:4:\"0.6%\";i:4;s:4:\"0.6%\";i:5;s:2:\"1%\";}}'),('salaryline','3500');
/*!40000 ALTER TABLE `yy_system_setting` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `yy_vacation_apply`
--

DROP TABLE IF EXISTS `yy_vacation_apply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `yy_vacation_apply` (
  `aid` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '申请ID',
  `uid` int(10) unsigned NOT NULL COMMENT '员工ID',
  `type` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1病假 2事假 3年假 4丧假 5生育假 6陪产假 7婚假',
  `begintime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '请假开始时间',
  `endtime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '请假结束时间',
  `dateline` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '提交申请的时间',
  `reason` varchar(1000) NOT NULL DEFAULT '' COMMENT '请假理由',
  `process` tinyint(1) NOT NULL DEFAULT '0' COMMENT '-3成功,已销假 -1成功,未销假  -2失败 0未审核 1审核人1 2审核人2以此类推',
  `howmany` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '总共几个人处理',
  `applytime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '理应申请的时间',
  PRIMARY KEY (`aid`),
  KEY `vacation_apply_uid` (`uid`),
  CONSTRAINT `vacation_apply_uid` FOREIGN KEY (`uid`) REFERENCES `yy_member` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=77 DEFAULT CHARSET=utf8 COMMENT='假期申请表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `yy_vacation_apply`
--

LOCK TABLES `yy_vacation_apply` WRITE;
/*!40000 ALTER TABLE `yy_vacation_apply` DISABLE KEYS */;
INSERT INTO `yy_vacation_apply` VALUES (5,7,1,1415635200,1417017600,1415243036,'123213123213',2,0,0),(8,35,2,1415203200,1415289600,1415203200,'事假',-2,0,0),(9,7,1,1415116800,1415635200,1414857600,'123124124',1,0,0),(10,7,1,1414944000,1415116800,1415894400,'123124124',1,0,0),(11,7,1,1417449600,1417536000,1415894400,'123124124',-2,0,0),(12,27,1,1415289600,1415332800,1415245325,'感冒',-3,0,0),(13,27,1,1415721600,1415808000,1415247789,'事假',-1,0,0),(14,8,3,1415289600,1415548800,1415269127,'123',-1,0,0),(15,8,1,1416931200,1417104000,1415269968,'123123123',1,0,0),(16,35,1,1418054400,1418832000,1415272681,'12312312313',1,0,0),(17,27,1,1415462400,1415894400,1415272740,'123',1,0,0),(18,7,1,1417104000,1417190400,1415331922,'夜之精粹夜之精粹夜之精粹夜之精粹',-1,0,0),(19,8,1,1415635200,1415894400,1415337373,'病假',-1,0,0),(20,8,1,1415116800,1415332800,1414771200,'病假',-3,0,0),(22,7,1,1417363200,1417363200,1415339100,'张顺昌张顺昌张顺昌',-1,0,0),(25,32,1,1415376000,1415592000,1415348130,'test',-3,0,0),(26,32,2,1415548800,1415592000,1415348145,'test',-3,0,0),(27,32,3,1415635200,1416499200,1415348158,'test',-1,0,0),(28,32,5,1417363200,1419955200,1415348178,'test',-1,0,0),(29,34,1,1415289600,1415376000,1415289600,'2333333333333333333333333333333333',-3,0,0),(30,1,1,1415894400,1416499200,1415348725,'病假',-1,0,0),(31,4,5,1415980800,1417190400,1415350074,'测试测试',1,0,0),(33,32,1,1414166400,1414166400,1415376000,'test',-1,0,0),(34,32,1,1414166400,1414166400,1415376000,'23',-1,0,0),(35,26,2,1413907200,1415419200,1413820800,'1',-3,0,0),(36,34,1,1415376000,1415462400,1415462400,'1233',-1,0,0),(37,34,1,1412611200,1412697600,1412697600,'1',2,0,0),(38,34,1,1412784000,1412784000,1412784000,'1',1,0,0),(39,37,1,1415030400,1415030400,1416758400,'11111111',1,0,0),(40,37,1,1415721600,1415721600,1415430317,'&amp;lt;alert&amp;gt;(&amp;quot;test&amp;quot;)&amp;lt;/&amp;gt;',1,0,0),(42,37,1,1415289600,1417104000,1416499200,'&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;   hjhh&amp;quot;',1,0,0),(43,5,2,1414425600,1414512000,1412611200,'fdgesrger',-1,0,0),(45,5,1,1413129600,1413216000,1412956800,'ferfef',-1,0,0),(46,5,2,1412784000,1412870400,1415462400,'dfgergergergera',-2,0,0),(47,5,2,1413820800,1413907200,1415439225,'哈哈哈哈',-1,0,1413561600),(48,27,1,1415894400,1415980800,1415590024,'病假',-1,0,1415590024),(49,27,1,1412697600,1412784000,1415590996,'病假',-1,0,1412092800),(50,27,1,1416153600,1416240000,1415595967,'感冒',1,0,1415595967),(51,18,1,1416844800,1416931200,1415599098,'感冒',-1,0,1415599098),(52,32,1,1422720000,1422979200,1415600388,'假事假事假事假事假事',2,0,1415600388),(53,32,1,1420905600,1420905600,1415600578,'假事假事假事假事假事假事',-2,0,1415600578),(54,7,5,1420300800,1420300800,1415600805,'请假事由请假事由请假事由请假事由请假事由',1,0,1415548800),(55,31,1,1415548800,1415635200,1415600869,'请假事由请假事由请假事由',2,0,1415548800),(56,31,1,1420905600,1420905600,1415601078,'请假事由请假事由请假事由请假事由',-1,0,1415601078),(57,31,1,1412956800,1412956800,1415603130,'事事事事事事',-1,0,1415548800),(58,32,1,1414166400,1414252800,1415603352,'病假',-1,0,1414080000),(59,32,1,1414771200,1414857600,1415603822,'病假',-1,0,1415603822),(60,32,1,1414944000,1415030400,1415604017,'1',-1,0,1415604017),(61,32,1,1415116800,1415203200,1415604039,'1',-1,0,1415604039),(62,32,1,1415030400,1415592000,1415604369,'1',-3,0,1415604369),(63,34,1,1414771200,1414857600,1415604785,'1',-1,0,1414684800),(66,31,1,1416844800,1416844800,1415606355,'下班前交周报 ',-1,0,1415606355),(67,32,1,1415332800,1415376000,1415606858,'病假',-1,0,1415203200),(68,39,1,1412870400,1412956800,1415607023,'1',-1,0,1412784000),(69,32,1,1417017600,1417104000,1415607183,'病假',-1,0,1415607183),(70,27,2,1415030400,1415116800,1415607187,'1',-1,0,1414944000),(71,39,2,1412956800,1413043200,1415607434,'1',-1,0,1412784000),(72,34,1,1413561600,1415592000,1415607476,'病假',-3,0,1412870400),(73,31,1,1412006400,1412092800,1415607747,'原来考勤结果是 旷工，  然后 补假，  考勤变为 请假了，  然后再销假',-1,0,1411920000),(74,34,1,1416758400,1416758400,1415607847,'123',-1,0,1415607847),(75,39,2,1413907200,1413993600,1415608544,'fafasefae',-1,0,1413734400),(76,31,1,1412956800,1413043200,1415609496,'运营支运营支运营支运营支',-1,0,1412784000);
/*!40000 ALTER TABLE `yy_vacation_apply` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2014-11-10 19:39:54
